---
title: "VLAN ã®ç·´ç¿’"
emoji: "ğŸ§³"
type: "tech" # tech: æŠ€è¡“è¨˜äº‹ / idea: ã‚¢ã‚¤ãƒ‡ã‚¢
topics: ["cisco", "ccna", "dynamips", "dynagen", "vlan"]
published: true
---

# æœ¬ã‚¨ãƒ³ãƒˆãƒªã«ã¤ã„ã¦

Dynagenã€Dynamipsã€vpcs ã‚’ä½¿ã£ã¦ã€VLAN ã®ç·´ç¿’ã‚’ã—ã¾ã™ã€‚
Dynagenã€Dynamipsã€vpcs ã®åˆ©ç”¨ç’°å¢ƒã¯ã™ã§ã«æ•´ã£ã¦ã„ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

Dynamips ã§ã¯ Catalyst ã‚¹ã‚¤ãƒƒãƒã®ã‚¨ãƒŸãƒ¥ãƒ¬ãƒ¼ã‚·ãƒ§ãƒ³ãŒã§ããªã„ã®ã§ã€ãƒ«ãƒ¼ã‚¿ã« NM-16ESW ã‚’ä¹—ã›ã¦ç·´ç¿’ã—ã¾ã™ã€‚
ãã®ãŸã‚ã€å®Ÿéš›ã® Catalyst ã‚¹ã‚¤ãƒƒãƒã¨ã¯å·®ç•°ãŒã‚ã‚‹å€‹æ‰€ãŒã‚ã‚Šã¾ã™ã€‚

## å‚è€ƒ
https://www.infraexpert.com/study/vlanz10.html

## ç’°å¢ƒã«ã¤ã„ã¦

åŒã˜VLANã«å±ã™ã‚‹ pc0 ã¨ pc1 é–“ã€pc2 ã¨ pc3 é–“ã§ç–é€šã§ãã‚‹ã‚ˆã†ã«ã—ã¾ã™ã€‚
```mermaid
architecture-beta
    group pc(cloud)[pc]
    service pc0(server)[pc0] in pc
    service br1(internet)[br1] in pc
    service tap0(internet)[tap0] in pc
    service sw01(internet)[sw01]
    service sw02(internet)[sw02]

    service pc1(server)[pc1]
    service pc2(server)[pc2]
    service pc3(server)[pc3]

    junction hub1
    junction hub1p1
    junction hub1p2
    junction hub1p3

    pc0:R -- L:br1
    br1:R -- L:tap0
    tap0:R -- L:hub1p1
    hub1p1:R -- L:hub1
    hub1:R -- L:sw01
    hub1p1:B -- T:hub1p2
    hub1p2:B -- T:hub1p3
    pc1:R -- L:hub1p2
    pc2:R -- L:hub1p3
    sw01:R -- L:sw02
    sw02:R -- L:pc3
```

| device | interface | ip address | network address | comment |
| --- | ----  | ---           | --- | --- |
| pc0 | br1   | 10.2.0.1/24 | 10.2.0.0 | vlan10 |
| pc1 | - | 10.2.0.2/24 | 10.2.0.0 | vlan10 |
| pc2 | - | 10.2.1.1/24 | 10.2.1.0 | vlan11 |
| pc3 | - | 10.2.1.2/24 | 10.2.1.0 | vlan11 |


è¿½åŠ ã™ã‚‹ VLAN
| vlan | vlan name | nw address | default g/w |
| --- | --- | --- | --- |
| vlan10 | vlan0010 | 10.2.0.0/24 | 10.2.0.254 |
| vlan11 | vlan0011 | 10.2.1.0/24 | 10.2.1.254 |


sw01ã€sw02 ã¨ã‚‚ä¸‹è¨˜ã® ãƒãƒ¼ãƒˆVLAN

| port | mode | vlan |
| --- | --- | --- |
| fa1/0 | access | vlan 10 |
| fa1/1 | access | vlan 10 |
| fa1/2 | access | vlan 10 |
| fa1/3 | access | vlan 10 |
| fa1/4 | access | vlan 11 |
| fa1/5 | access | vlan 11 |
| fa1/6 | access | vlan 11 |
| fa1/7 | access | vlan 11 |



```:Dynagen è¨­å®šãƒ•ã‚¡ã‚¤ãƒ«æŠœç²‹
        [[ROUTER sw01]]
                model = 3725
                slot1 = NM-16ESW
                console = 2001
                f1/0 = nio_tap:tap0
                f1/1 = NIO_udp:30000:127.0.0.1:20000
                f1/4 = NIO_udp:30001:127.0.0.1:20001
                f1/14 = sw02 f1/14

        [[ROUTER sw02]]
                model = 3725
                slot1 = NM-16ESW
                console = 2002
                f1/4 = NIO_udp:30002:127.0.0.1:20002
```

```:startup.vpc
1
ip 10.2.0.2 10.2.0.254 24
2
ip 10.2.1.1 10.2.1.254 24
3
ip 10.2.1.2 10.2.1.254 24
4
5
6
7
8
9
1
```

# VLANä½œæˆ

åˆæœŸçŠ¶æ…‹ã‹ã‚‰ VLAN ã‚’ä½œæˆã—ã¾ã™ã€‚
```
sw01#show vlan-s

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
                                                Fa1/4, Fa1/5, Fa1/6, Fa1/7
                                                Fa1/8, Fa1/9, Fa1/10, Fa1/11
                                                Fa1/12, Fa1/13, Fa1/14, Fa1/15
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        1002   1003
1002 fddi  101002     1500  -      -      -        -    -        1      1003
1003 tr    101003     1500  1005   0      -        -    srb      1      1002
1004 fdnet 101004     1500  -      -      1        ibm  -        0      0
1005 trnet 101005     1500  -      -      1        ibm  -        0      0
```

VLANã‚’ä½œæˆã™ã‚‹ã¨ãã€å¿…é ˆã§ã¯ã‚ã‚Šã¾ã›ã‚“ãŒã€ä»Šå›ã¯åå‰ã‚’è¨­å®šã—ã¾ã™ã€‚
```
sw01(config)#vlan 10
sw01(config-vlan)#name vlan0010

sw01(config-vlan)#vlan 11
sw01(config-vlan)#name vlan0011
```

VLANãŒä½œæˆã•ã‚Œã€åå‰ãŒè¨­å®šã•ã‚ŒãŸã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show vlan-switch

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
                                                Fa1/4, Fa1/5, Fa1/6, Fa1/7
                                                Fa1/8, Fa1/9, Fa1/10, Fa1/11
                                                Fa1/12, Fa1/13, Fa1/14, Fa1/15
10   vlan0010                         active
11   vlan0011                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        1002   1003
10   enet  100010     1500  -      -      -        -    -        0      0
11   enet  100011     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        1      1003
1003 tr    101003     1500  1005   0      -        -    srb      1      1002
1004 fdnet 101004     1500  -      -      1        ibm  -        0      0
1005 trnet 101005     1500  -      -      1        ibm  -        0      0
```

## ãƒãƒ¼ãƒˆã«VLANã‚’å‰²ã‚Šå½“ã¦ã‚‹

åˆæœŸçŠ¶æ…‹ã§ã¯å…¨ã¦ã®ã‚¹ã‚¤ãƒƒãƒãƒãƒ¼ãƒˆãŒ VLAN 1 ã«å‰²ã‚Šå½“ã¦ã‚‰ã‚Œã¦ã„ã¾ã™ã€‚
```
sw01#show int status

Port    Name               Status       Vlan       Duplex Speed Type
Fa1/0                      connected    1          a-full   a-100 10/100BaseTX
Fa1/1                      connected    1          a-full   a-100 10/100BaseTX
Fa1/2                      notconnect   1            auto    auto 10/100BaseTX
Fa1/3                      notconnect   1            auto    auto 10/100BaseTX
Fa1/4                      connected    1          a-full   a-100 10/100BaseTX
Fa1/5                      notconnect   1            auto    auto 10/100BaseTX
Fa1/6                      notconnect   1            auto    auto 10/100BaseTX
Fa1/7                      notconnect   1            auto    auto 10/100BaseTX
Fa1/8                      notconnect   1            auto    auto 10/100BaseTX
Fa1/9                      notconnect   1            auto    auto 10/100BaseTX
Fa1/10                     notconnect   1            auto    auto 10/100BaseTX
Fa1/11                     notconnect   1            auto    auto 10/100BaseTX
Fa1/12                     notconnect   1            auto    auto 10/100BaseTX
Fa1/13                     notconnect   1            auto    auto 10/100BaseTX
Fa1/14                     notconnect   1            auto    auto 10/100BaseTX
Fa1/15                     notconnect   1            auto    auto 10/100BaseTX
```

ã‚¹ã‚¤ãƒƒãƒãƒãƒ¼ãƒˆã®æƒ…å ±ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show int fa1/0 switchport
Name: Fa1/0
Switchport: Enabled
Administrative Mode: static access
Operational Mode: static access
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: native
Negotiation of Trunking: Disabled
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
Trunking VLANs Enabled: ALL
Trunking VLANs Active: 1
Protected: false
Priority for untagged frames: 0
Override vlan tag priority: FALSE
Voice VLAN: none
Appliance trust: none
```

æ‰€å®šã®å‰²ã‚Šå½“ã¦ã‚’å®Ÿæ–½ã—ã¾ã™ã€‚
```
sw01(config)#int range fa1/0 - 3
sw01(config-if-range)#switchport mode access
sw01(config-if-range)#switchport access vlan 10

sw01(config-if-range)#int range fa1/4 - 7
sw01(config-if-range)#switchport mode access
sw01(config-if-range)#switchport access vlan 11
```

å‰²ã‚Šå½“ã¦ã‚‰ã‚ŒãŸã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
ãƒãƒ¼ãƒˆã«ã¯ä¸€ã¤ã®VLANã—ã‹å‰²ã‚Šå½“ã¦ã‚‹ã“ã¨ã¯ã§ããªã„ã®ã§ã€VALN10ã€11ã‚’å‰²ã‚Šå½“ã¦ãŸãƒãƒ¼ãƒˆã¯ã€VLAN1ã®é …ç›®ã‹ã‚‰ã¯å‰Šé™¤ã•ã‚Œã¾ã™ã€‚
```
sw01#show vlan-switch                                                                                                                                                                                                                 [9/379]

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa1/8, Fa1/9, Fa1/10, Fa1/11
                                                Fa1/12, Fa1/13, Fa1/14, Fa1/15
10   vlan0010                         active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
11   vlan0011                         active    Fa1/4, Fa1/5, Fa1/6, Fa1/7
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        1002   1003
10   enet  100010     1500  -      -      -        -    -        0      0
11   enet  100011     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        1      1003
1003 tr    101003     1500  1005   0      -        -    srb      1      1002
1004 fdnet 101004     1500  -      -      1        ibm  -        0      0
1005 trnet 101005     1500  -      -      1        ibm  -        0      0

sw01#show int status

Port    Name               Status       Vlan       Duplex Speed Type
Fa1/0                      connected    10         a-full   a-100 10/100BaseTX
Fa1/1                      connected    10         a-full   a-100 10/100BaseTX
Fa1/2                      notconnect   10           auto    auto 10/100BaseTX
Fa1/3                      notconnect   10           auto    auto 10/100BaseTX
Fa1/4                      connected    11         a-full   a-100 10/100BaseTX
Fa1/5                      notconnect   11           auto    auto 10/100BaseTX
Fa1/6                      notconnect   11           auto    auto 10/100BaseTX
Fa1/7                      notconnect   11           auto    auto 10/100BaseTX
Fa1/8                      notconnect   1            auto    auto 10/100BaseTX
Fa1/9                      notconnect   1            auto    auto 10/100BaseTX
Fa1/10                     notconnect   1            auto    auto 10/100BaseTX
Fa1/11                     notconnect   1            auto    auto 10/100BaseTX
Fa1/12                     notconnect   1            auto    auto 10/100BaseTX
Fa1/13                     notconnect   1            auto    auto 10/100BaseTX
Fa1/14                     notconnect   1            auto    auto 10/100BaseTX
Fa1/15                     notconnect   1            auto    auto 10/100BaseTX
```

ã‚¹ã‚¤ãƒƒãƒãƒãƒ¼ãƒˆã®æƒ…å ±ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show int fa1/0 switchport
Name: Fa1/0
Switchport: Enabled
Administrative Mode: static access
Operational Mode: static access
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: native
Negotiation of Trunking: Disabled
Access Mode VLAN: 10 (vlan0010)
Trunking Native Mode VLAN: 1 (default)
Trunking VLANs Enabled: ALL
Trunking VLANs Active: 10
Protected: false
Priority for untagged frames: 0
Override vlan tag priority: FALSE
Voice VLAN: none
Appliance trust: none
```

## ç–é€šç¢ºèª

å¿…è¦ãªãƒãƒ¼ãƒˆãŒ up/up ã«ãªã£ã¦ã„ã‚‹ã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
up/down ã®ã¨ãã€ã„ã£ãŸã‚“ shut/no shut ã—ã¦ã¿ã¾ã™ã€‚
```
sw01#show ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
FastEthernet0/1            unassigned      YES unset  administratively down down
FastEthernet1/0            unassigned      YES unset  up                    up
FastEthernet1/1            unassigned      YES unset  up                    up
FastEthernet1/2            unassigned      YES unset  up                    down
FastEthernet1/3            unassigned      YES unset  up                    down
FastEthernet1/4            unassigned      YES unset  up                    up
FastEthernet1/5            unassigned      YES unset  up                    down
FastEthernet1/6            unassigned      YES unset  up                    down
FastEthernet1/7            unassigned      YES unset  up                    down
FastEthernet1/8            unassigned      YES unset  up                    down
FastEthernet1/9            unassigned      YES unset  up                    down
FastEthernet1/10           unassigned      YES unset  up                    down
FastEthernet1/11           unassigned      YES unset  up                    down
FastEthernet1/12           unassigned      YES unset  up                    down
FastEthernet1/13           unassigned      YES unset  up                    down
FastEthernet1/14           unassigned      YES unset  up                    down
FastEthernet1/15           unassigned      YES unset  up                    down
Vlan1                      unassigned      YES unset  up                    down
```

åŒã˜ VLAN10 ã«æ‰€å±ã—ã¦ã„ã‚‹ pc1 ã‹ã‚‰ pc0 ã«å¯¾ã—ã¦ ping ãŒé€šã‚‹ã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
VPCS[1]> ping 10.2.0.1
10.2.0.1 icmp_seq=1 ttl=64 time=0.224 ms
10.2.0.1 icmp_seq=2 ttl=64 time=0.132 ms
10.2.0.1 icmp_seq=3 ttl=64 time=0.106 ms
10.2.0.1 icmp_seq=4 ttl=64 time=0.106 ms
10.2.0.1 icmp_seq=5 ttl=64 time=0.107 ms
```

# SWã‚’ã¾ãŸã„ã VLANé€šä¿¡ã®ãŸã‚ã«ã‚¢ã‚¯ã‚»ã‚¹ãƒãƒ¼ãƒˆã‚’åˆ©ç”¨ã™ã‚‹

sw01ã€sw02 ä¸¡æ–¹ã«å­˜åœ¨ã™ã‚‹ VLAN11 åŒå£«ã§é€šä¿¡ã‚’ã™ã‚‹ãŸã‚ã«ã€ã‚¢ã‚¯ã‚»ã‚¹ãƒãƒ¼ãƒˆã‚’åˆ©ç”¨ã—ã¦ã¿ã¾ã™ã€‚

## sw01 ã«ã‚¢ã‚¯ã‚»ã‚¹ãƒãƒ¼ãƒˆã®è¿½åŠ 

sw01 ã«ã¦ ä¸¡ã‚¹ã‚¤ãƒƒãƒã‚’æ©‹æ¸¡ã—ã—ã¦ã„ã‚‹ fa1/14 ã« vlan 11ã‚’å‰²ã‚Šå½“ã¦ã¾ã™ã€‚
```
sw01(config)#int fa1/14
sw01(config-if)#switchport mode access
sw01(config-if)#switchport access vlan 11
```

fa1/14 ã« VLAN11 ãŒå‰²ã‚Šå½“ã¦ã‚‰ã‚ŒãŸã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show int status

Port    Name               Status       Vlan       Duplex Speed Type
Fa1/0                      connected    10         a-full   a-100 10/100BaseTX
Fa1/1                      connected    10         a-full   a-100 10/100BaseTX
Fa1/2                      notconnect   10           auto    auto 10/100BaseTX
Fa1/3                      notconnect   10           auto    auto 10/100BaseTX
Fa1/4                      connected    11         a-full   a-100 10/100BaseTX
Fa1/5                      notconnect   11           auto    auto 10/100BaseTX
Fa1/6                      notconnect   11           auto    auto 10/100BaseTX
Fa1/7                      notconnect   11           auto    auto 10/100BaseTX
Fa1/8                      notconnect   1            auto    auto 10/100BaseTX
Fa1/9                      notconnect   1            auto    auto 10/100BaseTX
Fa1/10                     notconnect   1            auto    auto 10/100BaseTX
Fa1/11                     notconnect   1            auto    auto 10/100BaseTX
Fa1/12                     notconnect   1            auto    auto 10/100BaseTX
Fa1/13                     notconnect   1            auto    auto 10/100BaseTX
Fa1/14                     notconnect   11           auto    auto 10/100BaseTX
Fa1/15                     notconnect   1            auto    auto 10/100BaseTX

sw01#show ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
FastEthernet0/1            unassigned      YES unset  administratively down down
FastEthernet1/0            unassigned      YES unset  up                    up
FastEthernet1/1            unassigned      YES unset  up                    up
FastEthernet1/2            unassigned      YES unset  up                    down
FastEthernet1/3            unassigned      YES unset  up                    down
FastEthernet1/4            unassigned      YES unset  up                    up
FastEthernet1/5            unassigned      YES unset  up                    down
FastEthernet1/6            unassigned      YES unset  up                    down
FastEthernet1/7            unassigned      YES unset  up                    down
FastEthernet1/8            unassigned      YES unset  up                    down
FastEthernet1/9            unassigned      YES unset  up                    down
FastEthernet1/10           unassigned      YES unset  up                    down
FastEthernet1/11           unassigned      YES unset  up                    down
FastEthernet1/12           unassigned      YES unset  up                    down
FastEthernet1/13           unassigned      YES unset  up                    down
FastEthernet1/14           unassigned      YES unset  up                    down
FastEthernet1/15           unassigned      YES unset  up                    down
Vlan1                      unassigned      YES unset  up                    down
```

## sw02 å´ã®è¨­å®š

VLAN11 ã‚’ä½œæˆã—ã€åå‰ã‚’è¨­å®šã—ã¾ã™ã€‚
```
sw02(config)#vlan 11
sw02(config-vlan)#name vlan0011

sw02#show vlan-switch

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
                                                Fa1/4, Fa1/5, Fa1/6, Fa1/7
                                                Fa1/8, Fa1/9, Fa1/10, Fa1/11
                                                Fa1/12, Fa1/13, Fa1/14, Fa1/15
11   vlan0011                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        1002   1003
11   enet  100011     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        1      1003
1003 tr    101003     1500  1005   0      -        -    srb      1      1002
1004 fdnet 101004     1500  -      -      1        ibm  -        0      0
1005 trnet 101005     1500  -      -      1        ibm  -        0      0
```

å„ãƒãƒ¼ãƒˆã«VLAN11ã‚’å‰²ã‚Šå½“ã¦ã¾ã™ã€‚
```
sw02(config)#int range fa1/4 - 7
sw02(config-if-range)#switchport mode access
sw02(config-if-range)#switchport access vlan 11

sw02(config-if-range)#int fa1/14
sw02(config-if)#switchport mode access
sw02(config-if)#switchport access vlan 11
```

å‰²ã‚Šå½“ã¦ã‚‰ã‚ŒãŸã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw02#show int status

Port    Name               Status       Vlan       Duplex Speed Type
Fa1/0                      notconnect   1            auto    auto 10/100BaseTX
Fa1/1                      notconnect   1            auto    auto 10/100BaseTX
Fa1/2                      notconnect   1            auto    auto 10/100BaseTX
Fa1/3                      notconnect   1            auto    auto 10/100BaseTX
Fa1/4                      connected    11         a-full   a-100 10/100BaseTX
Fa1/5                      notconnect   11           auto    auto 10/100BaseTX
Fa1/6                      notconnect   11           auto    auto 10/100BaseTX
Fa1/7                      notconnect   11           auto    auto 10/100BaseTX
Fa1/8                      notconnect   1            auto    auto 10/100BaseTX
Fa1/9                      notconnect   1            auto    auto 10/100BaseTX
Fa1/10                     notconnect   1            auto    auto 10/100BaseTX
Fa1/11                     notconnect   1            auto    auto 10/100BaseTX
Fa1/12                     notconnect   1            auto    auto 10/100BaseTX
Fa1/13                     notconnect   1            auto    auto 10/100BaseTX
Fa1/14                     connected    11         a-full   a-100 10/100BaseTX
Fa1/15                     notconnect   1            auto    auto 10/100BaseTX
```

## ç–é€šç¢ºèª

ãƒãƒ¼ãƒˆãŒ up/up ã§ãªã‘ã‚Œã° shut/no shut ã‚’è©¦ã—ã¾ã™ã€‚
```
sw02#show ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
FastEthernet0/1            unassigned      YES unset  administratively down down
FastEthernet1/0            unassigned      YES unset  up                    down
FastEthernet1/1            unassigned      YES unset  up                    down
FastEthernet1/2            unassigned      YES unset  up                    down
FastEthernet1/3            unassigned      YES unset  up                    down
FastEthernet1/4            unassigned      YES unset  up                    up
FastEthernet1/5            unassigned      YES unset  up                    down
FastEthernet1/6            unassigned      YES unset  up                    down
FastEthernet1/7            unassigned      YES unset  up                    down
FastEthernet1/8            unassigned      YES unset  up                    down
FastEthernet1/9            unassigned      YES unset  up                    down
FastEthernet1/10           unassigned      YES unset  up                    down
FastEthernet1/11           unassigned      YES unset  up                    down
FastEthernet1/12           unassigned      YES unset  up                    down
FastEthernet1/13           unassigned      YES unset  up                    down
FastEthernet1/14           unassigned      YES unset  up                    up
FastEthernet1/15           unassigned      YES unset  up                    down
Vlan1                      unassigned      YES unset  up                    down
```

ã“ã“ã§ã¯ sw01 ã® fa1/14 ãŒ up/down ã§ã—ãŸã®ã§ã€shut/no shut ã—ã¾ã—ãŸã€‚
```
sw01(config)#int fa1/14
sw01(config-if)#shut
sw01(config-if)#no shut

sw01#show ip int bri | inc 1/14
FastEthernet1/14           unassigned      YES unset  up                    up
```

sw01 ã® pc2 ã‹ã‚‰ sw02 ã® pc3 ã¸ã€ping ã‚’å®Ÿè¡Œã—ã¦ã¿ã¾ã™ã€‚
```
VPCS[2]> ping 10.2.1.2
10.2.1.2 icmp_seq=1 ttl=64 time=0.111 ms
10.2.1.2 icmp_seq=2 ttl=64 time=0.156 ms
10.2.1.2 icmp_seq=3 ttl=64 time=0.127 ms
10.2.1.2 icmp_seq=4 ttl=64 time=0.143 ms
10.2.1.2 icmp_seq=5 ttl=64 time=0.118 ms
```

# SWã‚’ã¾ãŸã„ã VLANé€šä¿¡ã®ãŸã‚ã« trunk ãƒãƒ¼ãƒˆã‚’åˆ©ç”¨ã™ã‚‹

ä¸Šè¨˜ã®ã‚¢ã‚¯ã‚»ã‚¹ãƒãƒ¼ãƒˆã‚’åˆ©ç”¨ã—ãŸã‚„ã‚Šæ–¹ã ã¨ã€VLAN ã®æ•°ã ã‘ã‚¹ã‚¤ãƒƒãƒé–“ã‚’æ©‹æ¸¡ã—ã™ã‚‹ãƒãƒ¼ãƒˆãŒå¿…è¦ã¨ãªã‚Šã¾ã™ã€‚
trunk ãƒãƒ¼ãƒˆã¯è¤‡æ•°ã®VLANã‚’é€šã™ã“ã¨ãŒã§ãã‚‹ãƒãƒ¼ãƒˆã§ã™ã€‚trunk ã‚’åˆ©ç”¨ã™ã‚‹ã¨ã€æ©‹æ¸¡ã—ã™ã‚‹ãƒãƒ¼ãƒˆã¯ä¸€ã¤ã§ã™ã¿ã¾ã™ã€‚

## trunk port ã®è¨­å®š

sw01 å´ã§ fa1/14 ã‚’ trunk ãƒãƒ¼ãƒˆã«æŒ‡å®šã—ã¾ã™ã€‚
```
sw01(config)#int fa1/14
sw01(config-if)#switchport trunk encapsulation dot1q
sw01(config-if)#switchport mode trunk
```

ãƒãƒ¼ãƒˆã®æƒ…å ±ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show int fa1/14 switchport
Name: Fa1/14
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: Disabled
Access Mode VLAN: 0 ((Inactive))
Trunking Native Mode VLAN: 1 (default)
Trunking VLANs Enabled: ALL
Trunking VLANs Active: 1,10-11
Protected: false
Priority for untagged frames: 0
Override vlan tag priority: FALSE
Voice VLAN: none
Appliance trust: none
```

trunk ãƒãƒ¼ãƒˆã®æƒ…å ±ã‚’ç¢ºèªã—ã¾ã™ã€‚
åˆ©ç”¨ã§ãã‚‹ VLAN ç•ªå·ã€å®Ÿéš›ã«è»¢é€ã•ã‚Œã‚‹ VLAN ç•ªå·ç­‰ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show int trunk

Port      Mode         Encapsulation  Status        Native vlan
Fa1/14    on           802.1q         trunking      1

Port      Vlans allowed on trunk
Fa1/14    1-4094

Port      Vlans allowed and active in management domain
Fa1/14    1,10-11

Port      Vlans in spanning tree forwarding state and not pruned
Fa1/14    1,10-11
```

ãƒãƒ¼ãƒˆã®æƒ…å ±ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show int status

Port    Name               Status       Vlan       Duplex Speed Type
Fa1/0                      connected    10         a-full   a-100 10/100BaseTX
Fa1/1                      connected    10         a-full   a-100 10/100BaseTX
Fa1/2                      notconnect   10           auto    auto 10/100BaseTX
Fa1/3                      notconnect   10           auto    auto 10/100BaseTX
Fa1/4                      connected    11         a-full   a-100 10/100BaseTX
Fa1/5                      notconnect   11           auto    auto 10/100BaseTX
Fa1/6                      notconnect   11           auto    auto 10/100BaseTX
Fa1/7                      notconnect   11           auto    auto 10/100BaseTX
Fa1/8                      notconnect   1            auto    auto 10/100BaseTX
Fa1/9                      notconnect   1            auto    auto 10/100BaseTX
Fa1/10                     notconnect   1            auto    auto 10/100BaseTX
Fa1/11                     notconnect   1
Fa1/12                     notconnect   1            auto    auto 10/100BaseTX
Fa1/13                     notconnect   1            auto    auto 10/100BaseTX
Fa1/14                     connected    trunk      a-full   a-100 10/100BaseTX
Fa1/15                     notconnect   1            auto    auto 10/100BaseTX
```


å¯¾å‘ã® sw02 å´ã§ã‚‚åŒæ§˜ã« trunk ãƒãƒ¼ãƒˆã®è¨­å®šã‚’ã—ã¾ã™ã€‚

```
sw02(config)#int fa1/14
sw02(config-if)#switchport trunk encapsulation dot1q
sw02(config-if)#switchport mode trunk
```

çµæœã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw02#show int fa1/14 switchport
Name: Fa1/14
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: Disabled
Access Mode VLAN: 0 ((Inactive))
Trunking Native Mode VLAN: 1 (default)
Trunking VLANs Enabled: ALL
Trunking VLANs Active: 1,11
Protected: false
Priority for untagged frames: 0
Override vlan tag priority: FALSE
Voice VLAN: none
Appliance trust: none
```
```
sw02#show int status

Port    Name               Status       Vlan       Duplex Speed Type
Fa1/0                      notconnect   1            auto    auto 10/100BaseTX
Fa1/1                      notconnect   1            auto    auto 10/100BaseTX
Fa1/2                      notconnect   1            auto    auto 10/100BaseTX
Fa1/3                      notconnect   1            auto    auto 10/100BaseTX
Fa1/4                      connected    11         a-full   a-100 10/100BaseTX
Fa1/5                      notconnect   11           auto    auto 10/100BaseTX
Fa1/6                      notconnect   11           auto    auto 10/100BaseTX
Fa1/7                      notconnect   11           auto    auto 10/100BaseTX
Fa1/8                      notconnect   1            auto    auto 10/100BaseTX
Fa1/9                      notconnect   1            auto    auto 10/100BaseTX
Fa1/10                     notconnect   1            auto    auto 10/100BaseTX
Fa1/11                     notconnect   1            auto    auto 10/100BaseTX
Fa1/12                     notconnect   1            auto    auto 10/100BaseTX
Fa1/13                     notconnect   1            auto    auto 10/100BaseTX
Fa1/14                     connected    trunk      a-full   a-100 10/100BaseTX
Fa1/15                     notconnect   1            auto    auto 10/100BaseTX
```

trunk ãƒãƒ¼ãƒˆã«æŒ‡å®šã—ãŸãƒãƒ¼ãƒˆã¯ã€ `show vlan-switch` ã«ã¯è¡¨ç¤ºã•ã‚Œãªããªã‚Šã¾ã™ã€‚
```
sw02#show vlan-switch

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
                                                Fa1/8, Fa1/9, Fa1/10, Fa1/11
                                                Fa1/12, Fa1/13, Fa1/15
11   vlan0011                         active    Fa1/4, Fa1/5, Fa1/6, Fa1/7
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        1002   1003
11   enet  100011     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        1      1003
1003 tr    101003     1500  1005   0      -        -    srb      1      1002
1004 fdnet 101004     1500  -      -      1        ibm  -        0      0
1005 trnet 101005     1500  -      -      1        ibm  -        0      0
```


## ç–é€šç¢ºèª

ã‚¢ã‚¯ã‚»ã‚¹ãƒãƒ¼ãƒˆã‚’åˆ©ç”¨ã—ãŸæ™‚ã¨åŒæ§˜ã€ç–é€šã§ãã‚‹ã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
```
VPCS[2]> ping 10.2.1.2
10.2.1.2 icmp_seq=1 ttl=64 time=0.082 ms
10.2.1.2 icmp_seq=2 ttl=64 time=0.121 ms
10.2.1.2 icmp_seq=3 ttl=64 time=0.135 ms
10.2.1.2 icmp_seq=4 ttl=64 time=0.188 ms
10.2.1.2 icmp_seq=5 ttl=64 time=0.142 ms
```

# VTP

é€šå¸¸ã¯VLANã‚’å¿…è¦ã¨ã™ã‚‹å…¨ã¦ã®ã‚¹ã‚¤ãƒƒãƒã§ã€VLAN ã‚’ä½œæˆã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚
VTP ã‚’åˆ©ç”¨ã™ã‚‹ã¨ã€ `Server` ã§ä½œæˆã—ãŸ VLAN ã‚’ `Client` ã«ä¼æ’­ã™ã‚‹ã“ã¨ãŒã§ãã‚‹ã‚ˆã†ã«ãªã‚Šã€å„ `Client` ã§ VLAN ã‚’ä½œæˆã™ã‚‹å¿…è¦ãŒãªããªã‚Šã¾ã™ã€‚

## Server ã®è¨­å®š

ãƒ‡ãƒ•ã‚©ãƒ«ãƒˆã§ `Server` ãƒ¢ãƒ¼ãƒ‰ã¨ãªã£ã¦ã„ã¾ã™ã€‚
```
sw01#show vtp status
VTP Version                     : 2
Configuration Revision          : 2
Maximum VLANs supported locally : 36
Number of existing VLANs        : 7
VTP Operating Mode              : Server
VTP Domain Name                 :
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x05 0xFB 0x5E 0x42 0x95 0x26 0x4C 0x04
Configuration last modified by 0.0.0.0 at 3-1-02 00:04:56
Local updater ID is 0.0.0.0 (no valid interface found)
```

VTP ãƒ‰ãƒ¡ã‚¤ãƒ³ã¨ã€ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¨­å®šã—ã¾ã™ã€‚
```
sw01(config)#vtp domain ccna
sw01(config)#vtp password cisco
```

çµæœã‚’ç¢ºèªã—ã¾ã™ã€‚
```
sw01#show vtp status
VTP Version                     : 2
Configuration Revision          : 2
Maximum VLANs supported locally : 36
Number of existing VLANs        : 7
VTP Operating Mode              : Server
VTP Domain Name                 : ccna
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x32 0x75 0xF4 0xD7 0x22 0xD7 0xE4 0x39
Configuration last modified by 0.0.0.0 at 3-1-02 00:04:56
Local updater ID is 0.0.0.0 (no valid interface found)
```


## Client ã®è¨­å®š

ãƒ¢ãƒ¼ãƒ‰ã‚’ `Client` ã«ã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚
```
sw02#show vtp status                                                                                                                                                                                                                 [17/581]
VTP Version                     : 2
Configuration Revision          : 1
Maximum VLANs supported locally : 36
Number of existing VLANs        : 6
VTP Operating Mode              : Server
VTP Domain Name                 :
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x5E 0x8C 0x69 0xAA 0x90 0x27 0xFB 0xD0
Configuration last modified by 0.0.0.0 at 3-1-02 00:05:21
Local updater ID is 0.0.0.0 (no valid interface found)
```

ãƒ¢ãƒ¼ãƒ‰ã‚’ `Client` ã«ã—ã€`Server` ã§æŒ‡å®šã—ãŸã®ã¨åŒã˜ VTP ãƒ‰ãƒ¡ã‚¤ãƒ³ã¨ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¨­å®šã—ã¾ã™ã€‚
```
sw02(config)#vtp mode client
sw02(config)#vtp domain ccna
sw02(config)#vtp password cisco
```

çµæœã‚’ç¢ºèªã—ã¾ã™ã€‚
Serverå´ã§ä½œæˆã—ã¦ã„ãŸ VLAN10 ãŒä¼æ’­ã•ã‚Œã€Client å´ã§è‡ªå‹•ã§ä½œæˆã•ã‚Œã¾ã—ãŸã€‚
```
sw02#show vtp status
VTP Version                     : 2
Configuration Revision          : 2
Maximum VLANs supported locally : 36
Number of existing VLANs        : 7
VTP Operating Mode              : Client
VTP Domain Name                 : ccna
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x32 0x75 0xF4 0xD7 0x22 0xD7 0xE4 0x39
Configuration last modified by 0.0.0.0 at 3-1-02 00:04:56

sw02#show vlan-switch

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
                                                Fa1/8, Fa1/9, Fa1/10, Fa1/11
                                                Fa1/12, Fa1/13, Fa1/15
10   vlan0010                         active
11   vlan0011                         active    Fa1/4, Fa1/5, Fa1/6, Fa1/7
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        1002   1003
10   enet  100010     1500  -      -      -        -    -        0      0
11   enet  100011     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      0      -        -    -        1      1003
1003 tr    101003     1500  1005   0      -        -    srb      1      1002
1004 fdnet 101004     1500  -      -      1        ibm  -        0      0
1005 trnet 101005     1500  -      -      1        ibm  -        0      0
```


# trunk ãƒãƒ¼ãƒˆã®åˆ¶é™

trunk ãƒãƒ¼ãƒˆã§ã¯ã€ä½•ã‚‚åˆ¶é™ã‚’ã—ãªã„ã¨ã€ã‚¹ã‚¤ãƒƒãƒã§ä½œæˆã—ã¦ã„ã‚‹å…¨ã¦ã® VLAN ãƒˆãƒ©ãƒ•ã‚£ãƒƒã‚¯ãŒè»¢é€ã•ã‚Œã¾ã™ã€‚
ä¸è¦ãª VLAN ãƒˆãƒ©ãƒ•ã‚£ãƒƒã‚¯ã®è»¢é€ã‚’é˜²æ­¢ã™ã‚‹ã“ã¨ã§ã€å¸¯åŸŸã®åˆ©ç”¨ã‚’åŠ¹ç‡åŒ–ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

ä¸€ã¤ã®ã‚„ã‚Šæ–¹ã¯ã€å„ trunk ãƒãƒ¼ãƒˆã§ `switchport trunk allowed vlan` ã®è¨­å®šã‚’ã™ã‚‹ã“ã¨ã§ã™ã€‚
```
sw02(config)#int fa1/14
sw02(config-if)#switchport trunk allowed vlan remove 10

sw02#show int trunk

Port      Mode         Encapsulation  Status        Native vlan
Fa1/14    on           802.1q         trunking      1

Port      Vlans allowed on trunk
Fa1/14    1-9,11-4094

Port      Vlans allowed and active in management domain
Fa1/14    1,11

Port      Vlans in spanning tree forwarding state and not pruned
Fa1/14    1,11
```

ã‚‚ã†ä¸€ã¤ã®ã‚„ã‚Šæ–¹ã¯ã€VTP Pruning ã‚’è¨­å®šã™ã‚‹ã“ã¨ã§ã™ã€‚
Server ãƒ¢ãƒ¼ãƒ‰ã®ã‚¹ã‚¤ãƒƒãƒã§è¨­å®šã—ã¾ã™ã€‚
```
sw01(config)#vtp pruning

sw01#show vtp status
VTP Version                     : 2
Configuration Revision          : 3
Maximum VLANs supported locally : 36
Number of existing VLANs        : 7
VTP Operating Mode              : Server
VTP Domain Name                 : ccna
VTP Pruning Mode                : Enabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x2A 0xE9 0xA3 0x6E 0x45 0xB9 0x88 0x96
Configuration last modified by 0.0.0.0 at 3-1-02 00:57:06
Local updater ID is 0.0.0.0 (no valid interface found)
```

è¨­å®šã™ã‚‹ã¨ã€Clientå´ã«ä¼æ’­ã—ã¾ã™ã€‚
```
sw02#show vtp status
VTP Version                     : 2
Configuration Revision          : 3
Maximum VLANs supported locally : 36
Number of existing VLANs        : 7
VTP Operating Mode              : Client
VTP Domain Name                 : ccna
VTP Pruning Mode                : Enabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x2A 0xE9 0xA3 0x6E 0x45 0xB9 0x88 0x96
Configuration last modified by 0.0.0.0 at 3-1-02 00:57:06
```

# ã¾ã¨ã‚

Dynagenã€Dynamipsã€vpcs ã‚’ä½¿ã£ã¦ã€VLAN Accessãƒãƒ¼ãƒˆã€Trunkãƒãƒ¼ãƒˆã€VTPç­‰ã®ç·´ç¿’ã‚’ã—ã¾ã—ãŸã€‚
å°‘ã—è¶³ã‚Šãªã„ãƒ­ã‚°ãŒã‚ã‚‹ã‚ˆã†ãªæ°—ã‚‚ã—ã¾ã™ã®ã§ã€ã‚ã¨ã§è£œè¶³ã™ã‚‹ã‹ã‚‚ã—ã‚Œã¾ã›ã‚“ã€‚
