---
title: "GLBP の練習"
emoji: "👨‍👦‍👦"
type: "tech" # tech: 技術記事 / idea: アイデア
topics: ["cisco", "ccna", "dynamips", "dynagen", "glbp"]
published: true
---

#  本エントリについて

Dynagen、Dynamips、vpcs を使って、GLBP を練習します。
Dynagen、Dynamips、vpcs の利用環境はすでに整っているものとします。

## 参考サイト

下記サイトを参考にしました。
https://www.infraexpert.com/study/fhrpz09.html

#  基本設定

https://zenn.dev/mnod/articles/895119218f52fe の練習をした環境を利用します。
GLBP を使うにあたり、トポロジーとしては適していませんが、練習として割り切ります。

sw01
```
conf t
hostname sw01
vlan 10
name vlan0010
vlan 11
name vlan0011
vtp domain ccna
vtp password cisco
vtp pruning
int fa1/0
switchport trunk encapsulation dot1q
switchport mode trunk
int fa1/15
switchport trunk encapsulation dot1q
switchport mode trunk
int vlan 1
ip addr 10.2.254.1 255.255.255.0
int vlan 10
ip addr 10.2.0.252 255.255.255.0
int vlan 11
ip addr 10.2.1.252 255.255.255.0
spanning-tree vlan 10 root primary
spanning-tree vlan 11 root secondary
```

sw02
```
conf t
hostname sw02
vtp mode client
vtp domain ccna
vtp password cisco
int fa1/0
switchport trunk encapsulation dot1q
switchport mode trunk
int fa1/15
switchport trunk encapsulation dot1q
switchport mode trunk
int vlan 1
ip addr 10.2.254.2 255.255.255.0
int vlan 10
ip addr 10.2.0.253 255.255.255.0
int vlan 11
ip addr 10.2.1.253 255.255.255.0
spanning-tree vlan 11 root primary
spanning-tree vlan 10 root secondary
```

sw11
```
conf t
hostname sw11
vtp mode client
vtp domain ccna
vtp password cisco
int fa1/14
switchport trunk encapsulation dot1q
switchport mode trunk
int fa1/15
switchport trunk encapsulation dot1q
switchport mode trunk
int range fa1/0 - 4
switchport mode access
switchport access vlan 10
int range fa1/4 - 7
switchport mode access
switchport access vlan 11
int vlan 1
ip addr 10.2.254.11 255.255.255.0
ip route 0.0.0.0 0.0.0.0 10.2.254.1
```

sw11 には Uplinkfast を入れておくと具合がいいかもしれない。
```
spanning-tree uplinkfast
```



# GLBP 有効化

`debug glbp events` を有効にして作業しています。

認証設定をして、GLBP を有効化します。

```
sw01(config)#key chain ccna
sw01(config-keychain)#key 102
sw01(config-keychain-key)#key-string cisco

sw01(config)#int vlan 10
sw01(config-if)#glbp 10 authentication md5 key-chain ccna
sw01(config-if)#glbp 10 ip 10.2.0.254

Dec 30 20:19:24.550: GLBP: joining IPv4 multicast on Vl10
Dec 30 20:19:24.550: GLBP: joining IPv6 multicast on Vl10
Dec 30 20:19:34.553: GLBP: Vl10 Interface up
Dec 30 20:19:35.856: GLBP: Vl10 API 10.2.0.254 is not a GLBP address in table 0
Dec 30 20:19:35.856: GLBP: Vl10 10 Disabled: a/GLBP IP address configured
Dec 30 20:19:35.856: GLBP: Vl10 10 Disabled -> Listen
Dec 30 20:19:45.855: GLBP: Vl10 10 Listen: g/Active timer expired (unknown)
Dec 30 20:19:45.859: GLBP: Vl10 10 Listen -> Speak
Dec 30 20:19:55.854: GLBP: Vl10 10 Speak: f/Standby timer expired (unknown)
Dec 30 20:19:55.854: GLBP: Vl10 10 Standby router is local
Dec 30 20:19:55.854: GLBP: Vl10 10 Speak -> Standby
Dec 30 20:19:55.854: GLBP: Vl10 10 Standby: g/Active timer expired (unknown)
Dec 30 20:19:55.854: GLBP: Vl10 10 Active router IP is local
Dec 30 20:19:55.854: GLBP: Vl10 10 Standby router is unknown, was local
Dec 30 20:19:55.854: GLBP: Vl10 10 Standby -> Active
Dec 30 20:19:55.854: %GLBP-6-STATECHANGE: Vlan10 Grp 10 state Standby -> Active
Dec 30 20:19:55.854: GLBP: Vl10 10.1 Disabled: a/Forwarder MAC address acquired
Dec 30 20:19:55.854: GLBP: Vl10 10.1 Disabled -> Listen
Dec 30 20:20:05.854: GLBP: Vl10 10.1 Listen: g/Active timer expired
Dec 30 20:20:05.854: GLBP: Vl10 10.1 Listen -> Active
Dec 30 20:20:05.854: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 1 state Listen -> Active
```

状態を確認します。
```
sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Active   10.2.0.254      local           unknown
Vl10        10   1   -   Active   0007.b400.0a01  local           -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    2 state changes, last state change 00:03:13
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.036 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption disabled
  Active is local
  Standby is unknown
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
  There is 1 forwarder (1 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:03:03
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
```

```
VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.893 ms
10.2.0.254 icmp_seq=2 ttl=255 time=8.604 ms
10.2.0.254 icmp_seq=3 ttl=255 time=9.709 ms
10.2.0.254 icmp_seq=4 ttl=255 time=2.669 ms
10.2.0.254 icmp_seq=5 ttl=255 time=1.013 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 112 seconds
```

sw02 でも同様に GLBP を有効にします。
```
sw02(config)#key chain ccna
sw02(config-keychain)#key 102
sw02(config-keychain-key)#key-string cisco
sw02(config-keychain-key)#
sw02(config-keychain-key)#int vlan 10
sw02(config-if)#glbp 10 authentication md5 key-chain ccna
sw02(config-if)#glbp 10 ip 10.2.0.254

Dec 30 20:25:39.903: GLBP: joining IPv4 multicast on Vl10
Dec 30 20:25:39.903: GLBP: joining IPv6 multicast on Vl10
Dec 30 20:25:49.919: GLBP: Vl10 10 Active router IP is 10.2.0.252
Dec 30 20:25:49.923: GLBP: Vl10 API 10.2.0.254 is not a GLBP address in table 0
Dec 30 20:25:49.927: GLBP: Vl10 10 Disabled: a/GLBP IP address configured
Dec 30 20:25:49.927: GLBP: Vl10 10 Disabled -> Init
Dec 30 20:25:49.927: GLBP: Vl10 10.1 Disabled: a/Forwarder MAC address acquired
Dec 30 20:25:49.927: GLBP: Vl10 10.1 Disabled -> Init
Dec 30 20:25:49.927: GLBP: Vl10 Interface up
Dec 30 20:26:10.039: GLBP: Vl10 10 Init: a/GLBP IP address configured
Dec 30 20:26:10.043: GLBP: Vl10 10 Init -> Listen
Dec 30 20:26:10.043: GLBP: Vl10 10.1 Init: d/Forwarder enabled
Dec 30 20:26:10.043: GLBP: Vl10 10.1 Init -> Listen
Dec 30 20:26:13.083: GLBP: Vl10 10.2 Disabled: a/Forwarder MAC address acquired
Dec 30 20:26:13.087: GLBP: Vl10 10.2 Disabled -> Listen
Dec 30 20:26:20.043: GLBP: Vl10 10 Listen: f/Standby timer expired (unknown)
Dec 30 20:26:20.047: GLBP: Vl10 10 Listen -> Speak
Dec 30 20:26:23.087: GLBP: Vl10 10.2 Listen: g/Active timer expired
Dec 30 20:26:23.091: GLBP: Vl10 10.2 Listen -> Active
Dec 30 20:26:23.091: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 2 state Listen -> Active
Dec 30 20:26:30.047: GLBP: Vl10 10 Speak: f/Standby timer expired (unknown)
Dec 30 20:26:30.051: GLBP: Vl10 10 Standby router is local
Dec 30 20:26:30.051: GLBP: Vl10 10 Speak -> Standby
```

状態を確認します。sw02 はスタンバイになりました。
```
sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    1 state change, last state change 00:01:52
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.452 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption disabled
  Active is 10.2.0.252, priority 100 (expires in 7.312 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14397.312 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 8.332 sec)
  Forwarder 2
    State is Active
      1 state change, last state change 00:02:01
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
```

sw01 でも状態を確認します。sw02 をスタンバイとして認識しています。
```
Dec 30 20:23:37.858: GLBP: Vl10 API Proxy ARP for 10.2.254.11 succeeded
Dec 30 20:23:50.846: GLBP: Vl10 API active virtual address 10.2.0.254 found
Dec 30 20:24:12.230: GLBP: Vl1 API active virtual address 10.2.254.11 not found
Dec 30 20:24:17.782: GLBP: Vl10 API Proxy ARP for 10.2.254.11 succeeded
Dec 30 20:24:20.614: GLBP: Vl10 API active virtual address 10.2.0.252 not found
Dec 30 20:25:21.778: GLBP: Vl10 API Proxy ARP for 10.2.254.11 succeeded
Dec 30 20:26:23.126: GLBP: Vl10 10.2 Disabled: a/Forwarder MAC address acquired
Dec 30 20:26:23.126: GLBP: Vl10 10.2 Disabled -> Listen
Dec 30 20:26:28.614: GLBP: Vl10 API active virtual address 10.2.0.252 not found
Dec 30 20:26:30.082: GLBP: Vl10 10 Standby router is 10.2.0.253
Dec 30 20:27:29.778: GLBP: Vl10 API Proxy ARP for 10.2.254.11 succeeded
Dec 30 20:28:36.614: GLBP: Vl10 API active virtual address 10.2.0.252 not found

sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    2 state changes, last state change 00:09:05
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.356 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption disabled
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 8.524 sec)
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:08:55
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 599.508 sec remaining (maximum 600 sec)
    Time to live: 14399.508 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 9.508 sec)
```

疎通確認を実施します。
```
VPCS[1]> show arp

arp table is empty

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.654 ms
10.2.0.254 icmp_seq=2 ttl=255 time=4.491 ms
10.2.0.254 icmp_seq=3 ttl=255 time=10.628 ms
10.2.0.254 icmp_seq=4 ttl=255 time=2.790 ms
10.2.0.254 icmp_seq=5 ttl=255 time=4.894 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 111 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 timeout
10.2.0.254 icmp_seq=2 ttl=255 time=5.950 ms
10.2.0.254 icmp_seq=3 ttl=255 time=9.033 ms
10.2.0.254 icmp_seq=4 ttl=255 time=8.479 ms
10.2.0.254 icmp_seq=5 ttl=255 time=4.775 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 112 seconds
c2:01:03:36:00:00  10.2.0.253 expires in 112 seconds
```

# preemption

GLBP のプリエンプション機能では、AVG の役割が引き継がれます。

priority 値が大きいほうが AVG の役割を持ちます。priority の値が同じ場合は、大きなIPアドレスを持っているほうがAVG になります。
ここで、試しに sw01 のpriority の値を悪化させてみます。

```
sw01(config)#int vlan 10
sw01(config-if)#glbp 10 priority 95
```

設定を確認します。
```
sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   95  Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    2 state changes, last state change 00:12:02
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.784 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption disabled
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 8.988 sec)
  Priority 95 (configured)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:11:52
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 2
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 597.236 sec remaining (maximum 600 sec)
    Time to live: 14397.232 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 7.228 sec)
    Client selection count: 1
```

sw02 でも確認します。
アクティブルータの priority が 95 になったことを認識しましたが、役割は変わっていません。
```
sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    1 state change, last state change 00:06:13
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.940 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption disabled
  Active is 10.2.0.252, priority 95 (expires in 7.752 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14397.748 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 8.428 sec)
  Forwarder 2
    State is Active
      1 state change, last state change 00:06:22
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
```

sw02 で preemption を設定します。
```
sw02(config)#int vlan 10
sw02(config-if)#glbp 10 preempt

Dec 30 20:33:31.900: GLBP: Vl10 10 Standby: l/Hello rcvd from lower pri Active router (95/10.2.0.252)
Dec 30 20:33:31.904: GLBP: Vl10 10 Active router IP is local, was 10.2.0.252
Dec 30 20:33:31.908: GLBP: Vl10 10 Standby router is unknown, was local
Dec 30 20:33:31.908: GLBP: Vl10 10 Standby -> Active
Dec 30 20:33:31.912: %GLBP-6-STATECHANGE: Vlan10 Grp 10 state Standby -> Active
Dec 30 20:33:41.932: GLBP: Vl10 10 Standby router is 10.2.0.252
```

状態を確認します。sw02 がアクティブルータになりました。
```
sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Active   10.2.0.254      local           10.2.0.252
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    2 state changes, last state change 00:00:52
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.468 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.252, priority 95 (expires in 9.516 sec)
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Redirection enabled, 599.516 sec remaining (maximum 600 sec)
    Time to live: 14397.856 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 7.856 sec)
  Forwarder 2
    State is Active
      1 state change, last state change 00:08:03
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
```

sw01 で状態を確認します。こちらはスタンバイルータになりました。
```
Dec 30 20:33:00.786: GLBP: Vl10 API Proxy ARP for 10.2.254.11 succeeded
Dec 30 20:33:31.918: GLBP: Vl10 Grp 10 Hello  in  VG Active  pri 100 vIP 10.2.0.254 hello 3000, hold 10000 VF 2 Active  pri 167 vMAC 0007.b400.0a02
Dec 30 20:33:31.922: GLBP: Vl10 10 Active router IP is 10.2.0.253, was local
Dec 30 20:33:31.922: GLBP: Vl10 10 Standby router is unknown, was 10.2.0.253
Dec 30 20:33:31.922: GLBP: Vl10 10 Active: k/Hello rcvd from higher pri Active router (100/10.2.0.253)
Dec 30 20:33:31.922: GLBP: Vl10 10 Active -> Speak
Dec 30 20:33:31.922: %GLBP-6-STATECHANGE: Vlan10 Grp 10 state Active -> Speak
Dec 30 20:33:41.922: GLBP: Vl10 10 Speak: f/Standby timer expired (unknown)
Dec 30 20:33:41.926: GLBP: Vl10 10 Standby router is local
Dec 30 20:33:41.926: GLBP: Vl10 10 Speak -> Standby
Dec 30 20:34:05.826: GLBP: Vl10 API active virtual address 10.2.0.252 not found

sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   95  Standby  10.2.0.254      10.2.0.253      local
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 00:01:10
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.920 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption disabled
  Active is 10.2.0.253, priority 100 (expires in 7.916 sec)
  Standby is local
  Priority 95 (configured)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:14:46
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 2
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Time to live: 14399.252 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 9.252 sec)
    Client selection count: 1
```

疎通確認を実施します。
```
VPCS[1]> show arp

arp table is empty

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.773 ms
10.2.0.254 icmp_seq=2 ttl=255 time=0.906 ms
10.2.0.254 icmp_seq=3 ttl=255 time=4.446 ms
10.2.0.254 icmp_seq=4 ttl=255 time=9.947 ms
10.2.0.254 icmp_seq=5 ttl=255 time=7.915 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 113 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.330 ms
10.2.0.254 icmp_seq=2 ttl=255 time=2.694 ms
10.2.0.254 icmp_seq=3 ttl=255 time=1.455 ms
10.2.0.254 icmp_seq=4 ttl=255 time=7.637 ms
10.2.0.254 icmp_seq=5 ttl=255 time=8.082 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 113 seconds
```


AVG を sw01 に戻すため、sw01 にて priority 値の変更と preemption 設定を実施します。
```
sw01(config)#int vlan 10
sw01(config-if)#glbp 10 priority 105
sw01(config-if)#glbp 10 preempt

Dec 30 20:37:19.930: GLBP: Vl10 10 Standby: l/Hello rcvd from lower pri Active router (100/10.2.0.253)
Dec 30 20:37:19.934: GLBP: Vl10 10 Active router IP is local, was 10.2.0.253
Dec 30 20:37:19.934: GLBP: Vl10 10 Standby router is unknown, was local
Dec 30 20:37:19.938: GLBP: Vl10 10 Standby -> Active
Dec 30 20:37:19.938: %GLBP-6-STATECHANGE: Vlan10 Grp 10 state Standby -> Active
Dec 30 20:37:29.974: GLBP: Vl10 10 Standby router is 10.2.0.253
```

状態を確認します。
```
sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   105 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    5 state changes, last state change 00:00:31
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.408 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 9.452 sec)
  Priority 105 (configured)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:17:45
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 2
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 599.940 sec remaining (maximum 600 sec)
    Time to live: 14399.936 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 9.936 sec)
    Client selection count: 1
```

sw02 でも状態を確認します。
```
Dec 30 20:35:10.324: GLBP: Vl10 API active virtual address 10.2.0.253 not found
Dec 30 20:35:39.584: GLBP: Vl10 API active virtual address 10.2.0.254 found
Dec 30 20:36:13.340: GLBP: Vl10 API active virtual address 10.2.0.254 found
Dec 30 20:37:19.948: GLBP: Vl10 Grp 10 Hello  in  VG Active  pri 105 vIP 10.2.0.254 hello 3000, hold 10000 VF 1 Active  pri 167 vMAC 0007.b400.0a01
Dec 30 20:37:19.948: GLBP: Vl10 10 Active router IP is 10.2.0.252, was local
Dec 30 20:37:19.948: GLBP: Vl10 10 Standby router is unknown, was 10.2.0.252
Dec 30 20:37:19.948: GLBP: Vl10 10 Active: k/Hello rcvd from higher pri Active router (105/10.2.0.252)
Dec 30 20:37:19.948: GLBP: Vl10 10 Active -> Speak
Dec 30 20:37:19.948: %GLBP-6-STATECHANGE: Vlan10 Grp 10 state Active -> Speak
Dec 30 20:37:29.948: GLBP: Vl10 10 Speak: f/Standby timer expired (unknown)
Dec 30 20:37:29.952: GLBP: Vl10 10 Standby router is local
Dec 30 20:37:29.952: GLBP: Vl10 10 Speak -> Standby

sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 00:00:58
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.392 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is 10.2.0.252, priority 105 (expires in 7.416 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14397.416 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 8.660 sec)
    Client selection count: 1
  Forwarder 2
    State is Active
      1 state change, last state change 00:12:07
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
```

疎通確認を実施します。
```
VPCS[1]> show arp

arp table is empty

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.060 ms
10.2.0.254 icmp_seq=2 ttl=255 time=5.703 ms
10.2.0.254 icmp_seq=3 ttl=255 time=6.382 ms
10.2.0.254 icmp_seq=4 ttl=255 time=7.096 ms
10.2.0.254 icmp_seq=5 ttl=255 time=4.305 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 113 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.646 ms
10.2.0.254 icmp_seq=2 ttl=255 time=10.701 ms
10.2.0.254 icmp_seq=3 ttl=255 time=5.612 ms
10.2.0.254 icmp_seq=4 ttl=255 time=6.702 ms
10.2.0.254 icmp_seq=5 ttl=255 time=9.862 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 112 seconds

```

# インタフェーストラッキング

GLBP では、インタフェーストラッキングによって、weighting 値を変更します。
weighting 値が、lower で指定した値を下回ったルータは AVF の役割をやめる、upper で指定した値を上回ると、AVF の役割を再開するようになります。

## sw01

sw01 でインタフェーストラッキングの設定をします。
```
sw01(config)#int vlan 10
sw01(config-if)#glbp 10 weighting 100 lower 95
sw01(config-if)#track 1 interface fa1/0 line-protocol
sw01(config-track)#int vlan 10
sw01(config-if)#glbp 10 weighting track 1 decrement 10

Dec 30 20:47:04.431: GLBP: Vl10 10 Track 1 add, decrement 10
Dec 30 20:47:04.435: GLBP: Vl10 10 Track 1 Start tracking
Dec 30 20:47:04.435: GLBP: Vl10 10 Track 1 link id 1
```

状態を確認します。
```
sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   105 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    5 state changes, last state change 00:10:57
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 2.720 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 7.588 sec)
  Priority 105 (configured)
  Weighting 100 (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Up decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:28:11
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 3
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 598.944 sec remaining (maximum 600 sec)
    Time to live: 14398.944 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 8.944 sec)
    Client selection count: 2
```

トラッキング対象のインタフェースを shutdown してみます。
```
sw01(config)#int fa1/0
sw01(config-if)#shut

Dec 30 20:48:52.215: %TRACKING-5-STATE: 1 interface Fa1/0 line-protocol Up->Down
Dec 30 20:48:52.219: GLBP: Vl10 10 Track 1 object changed, state Up -> Down
Dec 30 20:48:52.219: GLBP: Vl10 10 Weighting 100 -> 90
Dec 30 20:48:52.711: %DTP-5-NONTRUNKPORTON: Port Fa1/0 has become non-trunk
Dec 30 20:48:54.187: %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to administratively down
Dec 30 20:48:55.187: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
Dec 30 20:49:26.163: GLBP: Vl10 10.1 Active: i/Hello rcvd from higher pri Active router (135/10.2.0.253)
Dec 30 20:49:26.163: GLBP: Vl10 10.1 Active -> Listen
Dec 30 20:49:26.163: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 1 state Active -> Listen
sw01(config-if)#
```

状態を確認します。
```
sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   105 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.253      -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    5 state changes, last state change 00:12:30
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.204 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 8.040 sec)
  Priority 105 (configured)
  Weighting 90, low (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Down decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (0 active)
  Forwarder 1
    State is Listen
      2 state changes, last state change 00:00:23
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (secondary), weighting 100 (expires in 8.792 sec)
    Client selection count: 3
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 598.792 sec remaining (maximum 600 sec)
    Time to live: 14398.792 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 8.792 sec)
    Client selection count: 2
```

sw02 でも状態を確認します。
```
Dec 30 20:48:53.144: GLBP: Vl10 10.1 Preemption delayed, 30 secs remaining
Dec 30 20:49:26.148: GLBP: Vl10 10.1 Listen: k/Hello rcvd from lower pri Active router (39/10.2.0.252)
Dec 30 20:49:26.148: GLBP: Vl10 10.1 Listen -> Active
Dec 30 20:49:26.148: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 1 state Listen -> Active

sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 00:15:41
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.852 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is 10.2.0.252, priority 105 (expires in 7.060 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (2 active)
  Forwarder 1
    State is Active
      1 state change, last state change 00:03:45
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14173.148 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
  Forwarder 2
    State is Active
      1 state change, last state change 00:26:49
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
```

疎通確認を実施します。
```
VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=6.582 ms
10.2.0.254 icmp_seq=2 ttl=255 time=9.057 ms
10.2.0.254 icmp_seq=3 ttl=255 time=7.786 ms
10.2.0.254 icmp_seq=4 ttl=255 time=7.193 ms
10.2.0.254 icmp_seq=5 ttl=255 time=7.619 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 112 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.085 ms
10.2.0.254 icmp_seq=2 ttl=255 time=3.466 ms
10.2.0.254 icmp_seq=3 ttl=255 time=17.932 ms
10.2.0.254 icmp_seq=4 ttl=255 time=6.470 ms
10.2.0.254 icmp_seq=5 ttl=255 time=0.815 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 113 seconds

```

sw01 で shutdown したインタフェースを no shutdown します。
```
sw01(config)#int fa1/0
sw01(config-if)#no shut

Dec 30 23:14:22.575: %TRACKING-5-STATE: 1 interface Fa1/0 line-protocol Down->Up
Dec 30 23:14:22.575: GLBP: Vl10 10 Track 1 object changed, state Down -> Up
Dec 30 23:14:22.575: GLBP: Vl10 10 Weighting 90 -> 100
Dec 30 23:14:23.051: %DTP-5-TRUNKPORTON: Port Fa1/0 has become dot1q trunk
Dec 30 23:14:25.339: GLBP: Vl10 10.1 Preemption delayed, 30 secs remaining
Dec 30 23:14:25.503: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
Dec 30 23:14:55.355: GLBP: Vl10 10.1 Listen: k/Hello rcvd from lower pri Active router (135/10.2.0.253)
Dec 30 23:14:55.355: GLBP: Vl10 10.1 Listen -> Active
Dec 30 23:14:55.355: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 1 state Listen -> Active
```

状態を確認します。
```
sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   105 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    5 state changes, last state change 02:38:08
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.044 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 7.272 sec)
  Priority 105 (configured)
  Weighting 100 (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Up decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      3 state changes, last state change 00:00:32
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 5
  Forwarder 2
    State is Listen
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 599.144 sec remaining (maximum 600 sec)
    Time to live: 14399.144 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 9.144 sec)
    Client selection count: 4
```



sw02 でも状態を確認します。
```
Dec 30 23:14:55.360: GLBP: Vl10 10.1 Active: i/Hello rcvd from higher pri Active router (167/10.2.0.252)
Dec 30 23:14:55.364: GLBP: Vl10 10.1 Active -> Listen
Dec 30 23:14:55.364: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 1 state Active -> Listen

sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 02:38:47
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.928 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is 10.2.0.252, priority 105 (expires in 8.732 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (default 100), thresholds: lower 1, upper 100
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
      2 state changes, last state change 00:01:22
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14397.044 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 7.036 sec)
    Client selection count: 1
  Forwarder 2
    State is Active
      1 state change, last state change 02:49:56
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
```

疎通確認を実施します。
```
VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=19.290 ms
10.2.0.254 icmp_seq=2 ttl=255 time=4.885 ms
10.2.0.254 icmp_seq=3 ttl=255 time=6.921 ms
10.2.0.254 icmp_seq=4 ttl=255 time=11.945 ms
10.2.0.254 icmp_seq=5 ttl=255 time=7.520 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 113 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.723 ms
10.2.0.254 icmp_seq=2 ttl=255 time=10.729 ms
10.2.0.254 icmp_seq=3 ttl=255 time=4.580 ms
10.2.0.254 icmp_seq=4 ttl=255 time=2.453 ms
10.2.0.254 icmp_seq=5 ttl=255 time=0.689 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 112 seconds

```


## sw02

sw02 でインタエーストラッキングの設定をします。
```
sw02(config)#track 1 interface fa1/0 line-protocol
sw02(config-track)#int vlan 10
sw02(config-if)#glbp 10 weighting 100 lower 95
sw02(config-if)#glbp 10 weighting track 1 decrement 10

Dec 30 23:24:20.301: GLBP: Vl10 10 Track 1 add, decrement 10
Dec 30 23:24:20.301: GLBP: Vl10 10 Track 1 Start tracking
Dec 30 23:24:20.301: GLBP: Vl10 10 Track 1 link id 1
```

状態を確認します。
```
sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 02:47:24
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.104 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is 10.2.0.252, priority 105 (expires in 7.976 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Up decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
      2 state changes, last state change 00:09:58
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14399.292 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 9.292 sec)
    Client selection count: 1
  Forwarder 2
    State is Active
      1 state change, last state change 02:58:32
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
```


トラッキング対象のインタフェースを shutdown してみます。
```
sw02(config)#int fa1/0
sw02(config-if)#shut

Dec 30 23:26:05.681: %TRACKING-5-STATE: 1 interface Fa1/0 line-protocol Up->Down
Dec 30 23:26:05.681: GLBP: Vl10 10 Track 1 object changed, state Up -> Down
Dec 30 23:26:05.681: GLBP: Vl10 10 Weighting 100 -> 90
Dec 30 23:26:06.173: %DTP-5-NONTRUNKPORTON: Port Fa1/0 has become non-trunk
Dec 30 23:26:07.629: %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to administratively down
Dec 30 23:26:08.629: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
Dec 30 23:26:37.417: GLBP: Vl10 10.2 Active: i/Hello rcvd from higher pri Active router (135/10.2.0.252)
Dec 30 23:26:37.417: GLBP: Vl10 10.2 Active -> Listen
Dec 30 23:26:37.417: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 2 state Active -> Listen
Dec 30 23:26:38.197: GLBP: Vl10 API active virtual address 10.2.0.253 not found
```

状態を確認します。
```
sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.252      -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 02:49:37
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 2.936 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is 10.2.0.252, priority 105 (expires in 9.800 sec)
  Standby is local
  Priority 100 (default)
  Weighting 90, low (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Down decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (0 active)
  Forwarder 1
    State is Listen
      2 state changes, last state change 00:12:12
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14397.632 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 7.628 sec)
    Client selection count: 1
  Forwarder 2
    State is Listen
      2 state changes, last state change 00:00:32
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (secondary), weighting 100 (expires in 7.620 sec)
    Client selection count: 1
```

sw01 でも状態を確認します。
```
Dec 30 23:26:07.383: GLBP: Vl10 10.2 Preemption delayed, 30 secs remaining
Dec 30 23:26:37.407: GLBP: Vl10 10.2 Listen: k/Hello rcvd from lower pri Active router (39/10.2.0.253)
Dec 30 23:26:37.407: GLBP: Vl10 10.2 Listen -> Active
Dec 30 23:26:37.407: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 2 state Listen -> Active

sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   105 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    5 state changes, last state change 02:50:26
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.236 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 7.396 sec)
  Priority 105 (configured)
  Weighting 100 (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Up decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (2 active)
  Forwarder 1
    State is Active
      3 state changes, last state change 00:12:50
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 6
  Forwarder 2
    State is Active
      1 state change, last state change 00:01:10
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 529.644 sec remaining (maximum 600 sec)
    Time to live: 14329.644 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 5
```

疎通確認を実施します。
```
VPCS[1]> show arp

arp table is empty

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.839 ms
10.2.0.254 icmp_seq=2 ttl=255 time=10.242 ms
10.2.0.254 icmp_seq=3 ttl=255 time=8.938 ms
10.2.0.254 icmp_seq=4 ttl=255 time=7.459 ms
10.2.0.254 icmp_seq=5 ttl=255 time=10.564 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 106 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.473 ms
10.2.0.254 icmp_seq=2 ttl=255 time=8.280 ms
10.2.0.254 icmp_seq=3 ttl=255 time=5.299 ms
10.2.0.254 icmp_seq=4 ttl=255 time=4.645 ms
10.2.0.254 icmp_seq=5 ttl=255 time=8.620 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 113 seconds

```

sw02 で shutdown したインタフェースを no shutdown します。
```
sw02(config)#int fa1/0
sw02(config-if)#no shut

Dec 30 23:29:23.081: %TRACKING-5-STATE: 1 interface Fa1/0 line-protocol Down->Up
Dec 30 23:29:23.085: GLBP: Vl10 10 Track 1 object changed, state Down -> Up
Dec 30 23:29:23.085: GLBP: Vl10 10 Weighting 90 -> 100
Dec 30 23:29:23.133: %DTP-5-TRUNKPORTON: Port Fa1/0 has become dot1q trunk
Dec 30 23:29:25.253: GLBP: Vl10 10.2 Preemption delayed, 30 secs remaining
Dec 30 23:29:25.593: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
Dec 30 23:29:55.281: GLBP: Vl10 10.2 Listen: k/Hello rcvd from lower pri Active router (135/10.2.0.252)
Dec 30 23:29:55.281: GLBP: Vl10 10.2 Listen -> Active
Dec 30 23:29:55.281: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 2 state Listen -> Active
```

状態を確認します。
```
sw02#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   100 Standby  10.2.0.254      10.2.0.252      local
Vl10        10   1   -   Listen   0007.b400.0a01  10.2.0.252      -
Vl10        10   2   -   Active   0007.b400.0a02  local           -

sw02#show glbp vlan 10
Vlan10 - Group 10
  State is Standby
    4 state changes, last state change 02:52:53
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.924 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is 10.2.0.252, priority 105 (expires in 8.760 sec)
  Standby is local
  Priority 100 (default)
  Weighting 100 (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Up decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) authenticated
    c201.0336.0000 (10.2.0.253) local
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Listen
      2 state changes, last state change 00:15:28
    MAC address is 0007.b400.0a01 (learnt)
    Owner ID is c200.0336.0000
    Time to live: 14399.956 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.252 (primary), weighting 100 (expires in 9.956 sec)
    Client selection count: 1
  Forwarder 2
    State is Active
      3 state changes, last state change 00:00:30
    MAC address is 0007.b400.0a02 (default)
    Owner ID is c201.0336.0000
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 1
```

sw01 でも状態を確認します。
```
Dec 30 23:29:55.291: GLBP: Vl10 10.2 Active: i/Hello rcvd from higher pri Active router (167/10.2.0.253)
Dec 30 23:29:55.295: GLBP: Vl10 10.2 Active -> Listen
Dec 30 23:29:55.295: %GLBP-6-FWDSTATECHANGE: Vlan10 Grp 10 Fwd 2 state Active -> Listen

sw01#show glbp vlan 10 brief
Interface   Grp  Fwd Pri State    Address         Active router   Standby router
Vl10        10   -   105 Active   10.2.0.254      local           10.2.0.253
Vl10        10   1   -   Active   0007.b400.0a01  local           -
Vl10        10   2   -   Listen   0007.b400.0a02  10.2.0.253      -

sw01#show glbp vlan 10
Vlan10 - Group 10
  State is Active
    5 state changes, last state change 02:53:28
  Virtual IP address is 10.2.0.254
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 1.188 secs
  Redirect time 600 sec, forwarder timeout 14400 sec
  Authentication MD5, key-chain "ccna"
  Preemption enabled, min delay 0 sec
  Active is local
  Standby is 10.2.0.253, priority 100 (expires in 8.380 sec)
  Priority 105 (configured)
  Weighting 100 (configured 100), thresholds: lower 95, upper 100
    Track object 1 state Up decrement 10
  Load balancing: round-robin
  Group members:
    c200.0336.0000 (10.2.0.252) local
    c201.0336.0000 (10.2.0.253) authenticated
  There are 2 forwarders (1 active)
  Forwarder 1
    State is Active
      3 state changes, last state change 00:15:52
    MAC address is 0007.b400.0a01 (default)
    Owner ID is c200.0336.0000
    Redirection enabled
    Preemption enabled, min delay 30 sec
    Active is local, weighting 100
    Client selection count: 7
  Forwarder 2
    State is Listen
      2 state changes, last state change 00:00:54
    MAC address is 0007.b400.0a02 (learnt)
    Owner ID is c201.0336.0000
    Redirection enabled, 599.804 sec remaining (maximum 600 sec)
    Time to live: 14399.804 sec (maximum 14400 sec)
    Preemption enabled, min delay 30 sec
    Active is 10.2.0.253 (primary), weighting 100 (expires in 9.804 sec)
    Client selection count: 6
```

疎通確認を実施します。
```
VPCS[1]> show arp

arp table is empty

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.608 ms
10.2.0.254 icmp_seq=2 ttl=255 time=7.214 ms
10.2.0.254 icmp_seq=3 ttl=255 time=9.227 ms
10.2.0.254 icmp_seq=4 ttl=255 time=7.820 ms
10.2.0.254 icmp_seq=5 ttl=255 time=5.211 ms

VPCS[1]> show arp

00:07:b4:00:0a:01  10.2.0.254 expires in 113 seconds

VPCS[1]> clear arp

VPCS[1]> ping 10.2.0.254
10.2.0.254 icmp_seq=1 ttl=255 time=9.777 ms
10.2.0.254 icmp_seq=2 ttl=255 time=5.852 ms
10.2.0.254 icmp_seq=3 ttl=255 time=10.405 ms
10.2.0.254 icmp_seq=4 ttl=255 time=8.339 ms
10.2.0.254 icmp_seq=5 ttl=255 time=7.861 ms

VPCS[1]> show arp

00:07:b4:00:0a:02  10.2.0.254 expires in 113 seconds

```

# まとめ

Dynagen、Dynamips、vpcs を使って、GLBP を練習しました。
AVG 、AVF などの登場してきて、理解が大変です。
