---
title: "AAAã®ç·´ç¿’"
emoji: "ğŸ™†"
type: "tech"
topics: ["cisco", "ccna", "dynamips", "dynagen", "radius"]
published: false
---

# æœ¬ã‚¨ãƒ³ãƒˆãƒªã«ã¤ã„ã¦

Dynagenã€Dynamipsã€freeradius ã‚’ä½¿ã£ã¦ã€AAAèªè¨¼ã®è¨­å®šã‚’ç·´ç¿’ã—ã¾ã™ã€‚
Dynagenã€Dynamips ã®åˆ©ç”¨ç’°å¢ƒã¯ã™ã§ã«æ•´ã£ã¦ã„ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

## å‚è€ƒ

https://www.cisco.com/c/ja_jp/support/docs/security-vpn/remote-authentication-dial-user-service-radius/116291-configure-freeradius-00.html
https://www.cisco.com/c/en/us/support/docs/security-vpn/remote-authentication-dial-user-service-radius/116291-configure-freeradius-00.html
https://wiki.freeradius.org/vendor/Cisco

#  ç’°å¢ƒã«ã¤ã„ã¦

r1 ã‚’ radius client ã¨ã—ã¾ã™ã€‚
r1 ã¸ telnet ã™ã‚‹ã¨ãã®èªè¨¼ã«ã¤ã„ã¦ã€r1 ã‹ã‚‰ radius server ã¸å•åˆã›ã¾ã™ã€‚
r2 ã‹ã‚‰ r1 ã¸ telnet ã™ã‚‹ã“ã¨ã§å‹•ä½œã‚’ç¢ºèªã—ã¾ã™ã€‚

```
[radius server] .1 === (10.2.0.0/24) === .254 f0/0[r1]f0/1 .253 === (10.2.1.0/24) === .254 f0/0[r2]
```

```:Dynagen è¨­å®šãƒ•ã‚¡ã‚¤ãƒ«æŠœç²‹
    [[ETHSW sw1]]
        1 = access 1
        2 = access 1
        3 = access 1 NIO_udp:30001:127.0.0.1:20001
    [[ROUTER r1]]
        f0/0 = nio_tap:tap0
        f0/1 = sw1 1
    [[ROUTER r2]]
        model = 3725
        f0/0 = sw1 2
```

## radius ã‚µãƒ¼ãƒåŸºæœ¬è¨­å®š

radius ã‚µãƒ¼ãƒã¯ã€Debian buster ã§å‹•ã‹ã—ã¾ã™ã€‚ãƒ‘ãƒƒã‚±ãƒ¼ã‚¸ã§åˆ©ç”¨ã§ãã‚‹ `freeradius` ã‚’åˆ©ç”¨ã—ã¾ã™ã€‚
ãƒ­ãƒ¼ã‚«ãƒ«ã§ã®å‹•ä½œãƒ†ã‚¹ãƒˆã§ radtest ã‚’å®Ÿè¡Œã™ã‚‹ãŸã‚ `freeradius-utils` ã‚‚è¿½åŠ ã—ã¾ã™ã€‚ã“ã¡ã‚‰ã¯ã‚µãƒ¼ãƒã®å‹•ä½œè‡ªä½“ã«ã¯ä¸è¦ã§ã™ã€‚

```
$ sudo apt install -y freeradius freeradius-utils
```

ã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«ã—ãŸã‚‰ã€/etc/freeradius/clients.conf ãƒ•ã‚¡ã‚¤ãƒ«ã«æ¥ç¶šå…ƒã®ã‚¯ãƒ©ã‚¤ã‚¢ãƒ³ãƒˆ(Ciscoæ©Ÿå™¨)ã®ã‚¢ãƒ‰ãƒ¬ã‚¹ã‚„ã‚·ãƒ¼ã‚¯ãƒ¬ãƒƒãƒˆã‚’è¨˜è¼‰ã—ã¾ã™ã€‚
è¨˜è¼‰ã—ãŸã‚‰ radius ã‚µãƒ¼ãƒã‚’å†èµ·å‹•ã—ã¾ã™ã€‚

```
$ sudo cp -pi  /etc/freeradius/3.0/clients.conf{,.000}
$ sudo vi  /etc/freeradius/3.0/clients.conf
$ sudo diff -u /etc/freeradius/3.0/clients.conf{,.000}

@@ -266,8 +266,3 @@
 #              secret = testing123
 #      }
 #}
-client ciscolabo {
-       ipaddr = 10.2.0.0/16
-       secret = radiussecret
-}
-

$ sudo systemctl restart freeradius
```

ãªãŠã€radius ã‚µãƒ¼ãƒã¯ã€udp ã§å‹•ä½œã—ã¾ã™ã€‚

```
admin@ip-10-0-0-73:~$ sudo ss -apn | grep 1812
udp                UNCONN              0                    0                                                                        127.0.0.1:18120                                                0.0.0.0:*                                    users:(("freeradius",pid=938,fd=7))
udp                UNCONN              0                    0                                                                          0.0.0.0:1812                                                 0.0.0.0:*                                    users:(("freeradius",pid=938,fd=8))
udp                UNCONN              0                    0                                                                             [::]:1812                                                    [::]:*                                    users:(("freeradius",pid=938,fd=10))
admin@ip-10-0-0-73:~$
admin@ip-10-0-0-73:~$ sudo ss -apn | grep 1813
udp                UNCONN              0                    0                                                                          0.0.0.0:1813                                                 0.0.0.0:*                                    users:(("freeradius",pid=938,fd=9))
udp                UNCONN              0                    0                                                                             [::]:1813                                                    [::]:*                                    users:(("freeradius",pid=938,fd=11))
admin@ip-10-0-0-73:~$
```

# èªè¨¼(authentication)

èªè¨¼ã¯ã€Œèª°ã«ä½•ã‚’è¨±å¯ã™ã‚‹ã€ã® `èª°ã«` ã®éƒ¨åˆ†ã§ã™ã€‚

## freeradius å´è¨­å®š

freeradius ã®ãƒ¦ãƒ¼ã‚¶ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã¨ã—ã¦ã€rdb ã‚„ ldap ã‚‚ä½¿ã†ã“ã¨ã‚‚å¯èƒ½ã§ã™ãŒã€ã“ã“ã§ã¯ã‚·ãƒ³ãƒ—ãƒ«ã«ã€ãƒ†ã‚­ã‚¹ãƒˆãƒ•ã‚¡ã‚¤ãƒ«ã‚’åˆ©ç”¨ã—ã¾ã™ã€‚
ãƒ¦ãƒ¼ã‚¶ã‚’è¿½åŠ ã—ãŸã‚‰ã€ãƒ‡ãƒ¼ãƒ¢ãƒ³ã‚’å†èµ·å‹•ã—ã¾ã™ã€‚

```
$ sudo cp -pi /etc/freeradius/3.0/mods-config/files/authorize{,.000}
$ sudo vi /etc/freeradius/3.0/mods-config/files/authorize
$ sudo diff -u /etc/freeradius/3.0/mods-config/files/authorize{,.000}

@@ -1,4 +1,3 @@
-ccna Cleartext-Password := "cisco"

$ sudo systemctl restart freeradius
```

ã„ã£ãŸã‚“ãƒ­ãƒ¼ã‚«ãƒ«ã§ `radtest` ã‚³ãƒãƒ³ãƒ‰ã§å‹•ä½œãƒ†ã‚¹ãƒˆã‚’ã—ã¦ã¿ã¾ã™ã€‚
ä»¥ä¸‹ã¯èªè¨¼æˆåŠŸã®ä¾‹ã§ã™ã€‚

```
$ radtest ccna cisco 127.0.0.1 1812 testing123
Sent Access-Request Id 241 from 0.0.0.0:38371 to 127.0.0.1:1812 length 74
        User-Name = "ccna"
        User-Password = "cisco"
        NAS-IP-Address = 127.0.1.1
        NAS-Port = 1812
        Message-Authenticator = 0x00
        Cleartext-Password = "cisco"
Received Access-Accept Id 241 from 127.0.0.1:1812 to 127.0.0.1:38371 length 20
```

```
$ radtest ccna cisco 10.2.0.1  1812 radiussecret
Sent Access-Request Id 160 from 0.0.0.0:34124 to 10.2.0.1:1812 length 74
        User-Name = "ccna"
        User-Password = "cisco"
        NAS-IP-Address = 127.0.1.1
        NAS-Port = 1812
        Message-Authenticator = 0x00
        Cleartext-Password = "cisco"
Received Access-Accept Id 160 from 10.2.0.1:1812 to 10.2.0.1:34124 length 20
```

radius ã‚µãƒ¼ãƒãŒèµ·å‹•ã—ã¦ã„ãªã„ã¨ãã¯ä¸‹è¨˜ãŒè¡¨ç¤ºã•ã‚Œã¾ã™ã€‚

```
(0) No reply from server for ID 35 socket 3
```

èªè¨¼ãŒé€šã‚‰ãªã‹ã£ãŸæ™‚ã®ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã¯ä¸‹è¨˜ã®ã‚ˆã†ã«ãªã‚Šã¾ã™ã€‚

```
Received Access-Reject Id 245 from 10.2.0.1:1812 to 10.2.0.1:47980 length 20
(0) -: Expected Access-Accept got Access-Reject
```

## Cisco ãƒ‡ãƒã‚¤ã‚¹å´è¨­å®š

radius ã‚µãƒ¼ãƒã®æƒ…å ±ã‚’è¨­å®šã—ã¾ã™ã€‚

```
r1(config)#aaa new-model
r1(config)#radius-server host 10.2.0.1 auth-port 1812 acct-port 1813
r1(config)#radius-server key radiussecret
```

è¨­å®šã—ãŸå†…å®¹ã‚’ç¢ºèªã—ã¾ã™ã€‚

```
r1#show aaa servers

RADIUS: id 2, priority 1, host 10.2.0.1, auth-port 1812, acct-port 1812
     State: current UP, duration 1247s, previous duration 0s
     Dead: total time 0s, count 0
     Quarantined: No
     Authen: request 12, timeouts 0
             Response: unexpected 0, server error 0, incorrect 1, time 1567699ms
             Transaction: success 11, failure 1
     Author: request 0, timeouts 0
             Response: unexpected 0, server error 0, incorrect 0, time 0ms
             Transaction: success 0, failure 0
     Account: request 0, timeouts 0
             Response: unexpected 0, server error 0, incorrect 0, time 0ms
             Transaction: success 0, failure 0
     Elapsed time since counters last cleared: 20m
     Estimated Outstanding Access Transactions: 0
     Estimated Outstanding Accounting Transactions: 0
```

è¨­å®šã—ãŸ radius ã‚µãƒ¼ãƒã«å¯¾ã—ã¦ã„ã£ãŸã‚“ãƒ†ã‚¹ãƒˆã—ã¾ã™ã€‚
æ­£ã—ã„èªè¨¼æƒ…å ±ã‚’ä¸ãˆã¦ã¿ã¾ã™ã€‚

```
r1#test aaa group radius server 10.2.0.1 ccna cisco legacy
Attempting authentication test to server-group radius using radius
User was successfully authenticated.
```

èª¤ã£ãŸèªè¨¼æƒ…å ±ã‚’ä¸ãˆã¦ã¿ã¾ã™ã€‚

```
r1#test aaa group radius server 10.2.0.1 cca cisco legacy
Attempting authentication test to server-group radius using radius
User authentication request was rejected by server.
```

ä¸‹è¨˜ã§ã‚‚ãƒ†ã‚¹ãƒˆå®Ÿè¡Œã§ãã¾ã™ã€‚

```
r1#test aaa group radius ccna cisco legacy
Attempting authentication test to server-group radius using radius
User was successfully authenticated.
```

## ä»®æƒ³ç«¯æœ«ã«èªè¨¼è¨­å®šã‚’è¿½åŠ 

æœ€åˆã«ã€ãƒ­ãƒ¼ã‚«ãƒ«ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã«ãƒ•ã‚©ãƒ¼ãƒ«ãƒãƒƒã‚¯ç”¨ã®ãƒ¦ãƒ¼ã‚¶ã‚’ä½œæˆã—ã¦ãŠãã¾ã™ã€‚

```
r1(config)#username user  privilege 1  password 0 cisco
```

ã€Œãƒ‡ãƒ•ã‚©ãƒ«ãƒˆã ã¨ã€æœ€åˆã« radius èªè¨¼ã€radius ã«æ¥ç¶šã§ããªã„ã¨ãã¯ãƒ­ãƒ¼ã‚«ãƒ«èªè¨¼ã€ ã™ã‚‹ã‚ˆã†ã«è¨­å®šã—ã¾ã™ã€‚

```
r1(config)#aaa authentication login default group radius local
r1(config)#line vty 0 4
r1(config-line)#login authentication default
```

ãƒ­ã‚°ã‚¤ãƒ³ãƒ†ã‚¹ãƒˆã—ã¾ã™ã€‚

```
r2#telnet 10.2.1.253
Trying 10.2.1.253 ... Open


User Access Verification

Username: ccna
Password:

r1>
```

radius ã‚µãƒ¼ãƒã‚’åœæ­¢ã—ã¦ã€ãƒ•ã‚©ãƒ¼ãƒ«ãƒãƒƒã‚¯ã®ç¢ºèªã‚’ã—ã¦ã¿ã¾ã™ã€‚

```
admin@ip-10-0-0-73:~$ sudo systemctl stop freeradius
```

ã“ã®ã‚ˆã†ã«ã€radius ã‚µãƒ¼ãƒãŒå¿œç­”ã—ãªã„å ´åˆã€ãƒ­ãƒ¼ã‚«ãƒ«èªè¨¼ã§ãƒ­ã‚°ã‚¤ãƒ³ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚
ãªãŠã€ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’å…¥åŠ›ã—ã¦ã‹ã‚‰ radius ã‚µãƒ¼ãƒã¨ã®æ¥ç¶šãŒã‚¿ã‚¤ãƒ ã‚¢ã‚¦ãƒˆã™ã‚‹ã¾ã§å°‘ã—æ™‚é–“ãŒã‹ã‹ã‚Šã¾ã™ã€‚

```
r2#telnet 10.2.1.253
Trying 10.2.1.253 ... Open


User Access Verification

Username: ccna
Password:

% Authentication failed

Username: user
Password:

r1>
```

ãƒ†ã‚¹ãƒˆã‚’çµ‚ãˆãŸã‚‰ã€radius ã‚µãƒ¼ãƒã‚’èµ·å‹•ã—ã¦ãŠãã¾ã™ã€‚

```
admin@ip-10-0-0-73:~$ sudo systemctl start freeradius
```

# èªå¯(authorization)

èªå¯(è¨±å¯)ã¯ã€Œèª°ã«ä½•ã‚’è¨±å¯ã™ã‚‹ã€ã® `ä½•ã‚’` ã®éƒ¨åˆ†ã§ã™ã€‚
æ¨©é™ãƒ¬ãƒ™ãƒ«ã‚’æŒ‡å®šã™ã‚‹ã“ã¨ã§ã€ä½•ã‚’è¨±å¯ã™ã‚‹ã®ã‹ã‚’å®šç¾©ã—ã¾ã™ã€‚

## freeradius å´è¨­å®š

ä¸‹è¨˜ã®ã‚ˆã†ã«ã€ãƒ¦ãƒ¼ã‚¶ã”ã¨ã«æ¨©é™ãƒ¬ãƒ™ãƒ«ã‚’è¨­å®šã—ã¾ã™ã€‚èªè¨¼ã¨èªå¯ã¯åŒã˜è¨­å®šãƒ•ã‚¡ã‚¤ãƒ«ã«è¨˜è¼‰ã—ã¾ã™ã€‚
è¨­å®šãƒ•ã‚¡ã‚¤ãƒ«ã‚’å¤‰æ›´ã—ãŸã‚‰ radius ã‚µãƒ¼ãƒã‚’å†èµ·å‹•ã—ã¾ã™ã€‚

```
$ sudo ls -l /etc/freeradius/3.0/mods-config/files/authorize{,.001}
$ sudo cp -p /etc/freeradius/3.0/mods-config/files/authorize{,.001}
$ sudo vi /etc/freeradius/3.0/mods-config/files/authorize
$ sudo diff -u /etc/freeradius/3.0/mods-config/files/authorize{,.001}

@@ -1,11 +1,4 @@
-ccna  Cleartext-Password := "cisco"
-      Cisco-AVPair = "shell:priv-lvl=0"
-
-ccnp  Cleartext-Password := "cisco"
-      Cisco-AVPair = "shell:priv-lvl=1"
-
-ccie  Cleartext-Password := "cisco"
-      Cisco-AVPair = "shell:priv-lvl=15"
+ccna Cleartext-Password := "cisco"

$ sudo systemctl restart freeradius
```

## Cisco ãƒ‡ãƒã‚¤ã‚¹å´è¨­å®š

èªå¯ã®è¨­å®šã‚’è¿½åŠ ã—ã¾ã™ã€‚

```
switch(config)#aaa authorization exec default group radius if-authenticated
```

ccna ãƒ¦ãƒ¼ã‚¶ã§æ¥ç¶šã—ã¦ã¿ã¾ã™ã€‚
æ¨©é™ãƒ¬ãƒ™ãƒ«0ãªã®ã§ã€å®Ÿè¡Œã§ãã‚‹ã‚³ãƒãƒ³ãƒ‰ãŒã”ãé™ã‚‰ã‚ŒãŸã‚‚ã®ã«ãªã‚Šã¾ã™ã€‚

```
r2#telnet 10.2.1.253
Trying 10.2.1.253 ... Open


User Access Verification

Username: ccna
Password:

r1>
r1>?
Exec commands:
  <1-99>   Session number to resume
  disable  Turn off privileged commands
  enable   Turn on privileged commands
  exit     Exit from the EXEC
  help     Description of the interactive help system
  logout   Exit from the EXEC

r1>
```

ccie ãƒ¦ãƒ¼ã‚¶ã§æ¥ç¶šã—ã¦ã¿ã¾ã™ã€‚
æ¨©é™ãƒ¬ãƒ™ãƒ«15ãªã®ã§ã€ç‰¹æ¨©ãƒ¬ãƒ™ãƒ«ã¨ãªã‚Šã€ãƒ—ãƒ­ãƒ³ãƒ—ãƒˆãŒ `#` ã¨ãªã‚Šã¾ã™ã€‚

```
r2#telnet 10.2.1.253
Trying 10.2.1.253 ... Open


User Access Verification

Username: ccie
Password:

r1#
```

# ã‚¢ã‚«ã‚¦ãƒ³ãƒ†ã‚£ãƒ³ã‚°(accounting)

ã‚¢ã‚«ã‚¦ãƒ³ãƒ†ã‚£ãƒ³ã‚°ã®è¨­å®šã‚’è¿½åŠ ã—ã¾ã™ã€‚

```
r1(config)#aaa accounting exec default start-stop group radius
```

ãƒ­ã‚°ã‚¤ãƒ³ã€ãƒ­ã‚°ã‚¢ã‚¦ãƒˆã—ã¦ã¿ã¾ã™ã€‚

```
r2#telnet 10.2.1.253
Trying 10.2.1.253 ... Open


User Access Verification

Username: ccna
Password:

r1>
r1>exit

[Connection to 10.2.1.253 closed by foreign host]
```

radius ã‚µãƒ¼ãƒã«ã€ä¸‹è¨˜ã®ã‚ˆã†ã«ãƒ­ã‚°ãŒå‡ºåŠ›ã•ã‚Œã¾ã™ã€‚

```
admin@ip-10-0-0-73:~$ sudo ls -lR /var/log/freeradius/radacct
/var/log/freeradius/radacct:
total 4
drwx------ 2 freerad freerad 4096 Dec 19 08:03 10.2.0.254

/var/log/freeradius/radacct/10.2.0.254:
total 8
-rw------- 1 freerad freerad 4882 Dec 19 20:41 detail-20221219
admin@ip-10-0-0-73:~$ sudo cat /var/log/freeradius/radacct/10.2.0.254/detail-20221219

Mon Dec 19 20:41:05 2022
        Acct-Session-Id = "00000006"
        User-Name = "ccna"
        Acct-Authentic = RADIUS
        Acct-Status-Type = Start
        NAS-Port = 98
        NAS-Port-Id = "tty98"
        NAS-Port-Type = Virtual
        Calling-Station-Id = "10.2.1.254"
        Service-Type = NAS-Prompt-User
        NAS-IP-Address = 10.2.0.254
        Acct-Delay-Time = 0
        Event-Timestamp = "Dec 19 2022 20:41:05 JST"
        Tmp-String-9 = "ai:"
        Acct-Unique-Session-Id = "593a6a14c7b4bf3364eda1acdc6ab048"
        Timestamp = 1671450065

Mon Dec 19 20:41:40 2022
        Acct-Session-Id = "00000006"
        User-Name = "ccna"
        Acct-Authentic = RADIUS
        Acct-Terminate-Cause = User-Request
        Acct-Session-Time = 35
        Acct-Status-Type = Stop
        NAS-Port = 98
        NAS-Port-Id = "tty98"
        NAS-Port-Type = Virtual
        Calling-Station-Id = "10.2.1.254"
        Service-Type = NAS-Prompt-User
        NAS-IP-Address = 10.2.0.254
        Acct-Delay-Time = 0
        Event-Timestamp = "Dec 19 2022 20:41:40 JST"
        Tmp-String-9 = "ai:"
        Acct-Unique-Session-Id = "593a6a14c7b4bf3364eda1acdc6ab048"
        Timestamp = 1671450100

```

# ã¾ã¨ã‚

freeradius ã‚’ä½¿ç”¨ã—ã¦ã€Cisco ãƒ‡ãƒã‚¤ã‚¹ã®AAAèªè¨¼ã®è¨­å®šã‚’ç·´ç¿’ã—ã¾ã—ãŸã€‚
ãƒ¦ãƒ¼ã‚¶ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã‚’ã€ä»Šå›ã®ã‚ˆã†ãªãƒ•ã‚¡ã‚¤ãƒ«ã§ã¯ãªãã€å¤–éƒ¨ã® rdb ã‚µãƒ¼ãƒã‚„ ldap ã‚µãƒ¼ãƒã¨é€£æºã—ã¦ã¿ã‚‹ã®ã‚‚~~æ¥½ã—ã„~~å‹‰å¼·ã«ãªã‚‹ã¨æ€ã„ã¾ã™ã€‚
