---
title: "tftp ã®ç·´ç¿’"
emoji: "ğŸ’¾"
type: "tech" # tech: æŠ€è¡“è¨˜äº‹ / idea: ã‚¢ã‚¤ãƒ‡ã‚¢
topics: ["cisco", "ccna", "dynamips", "dynagen", "tftp"]
published: true
---

# æœ¬ã‚¨ãƒ³ãƒˆãƒªã«ã¤ã„ã¦

Dynagenã€Dynamipsã€tftpd ã‚’ä½¿ã£ã¦ã€ã‚³ãƒ³ãƒ•ã‚£ã‚°ã®ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã‚’ç·´ç¿’ã—ã¾ã™ã€‚
Dynagenã€Dynamips ã®åˆ©ç”¨ç’°å¢ƒã¯ã™ã§ã«æ•´ã£ã¦ã„ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

## å‚è€ƒ

https://www.cisco.com/c/ja_jp/support/docs/ios-nx-os-software/ios-software-releases-122-mainline/46741-backup-config.html
https://community.cisco.com/t5/%E3%83%8D%E3%83%83%E3%83%88%E3%83%AF%E3%83%BC%E3%82%AF%E3%82%A4%E3%83%B3%E3%83%95%E3%83%A9%E3%82%B9%E3%83%88%E3%83%A9%E3%82%AF%E3%83%81%E3%83%A3-%E3%83%89%E3%82%AD%E3%83%A5%E3%83%A1%E3%83%B3%E3%83%88/%E3%83%91%E3%82%A4%E3%83%97%E3%81%AE%E4%BD%BF%E7%94%A8%E6%96%B9%E6%B3%95/ta-p/3153528


# ç’°å¢ƒã«ã¤ã„ã¦

r1 ã®ã‚³ãƒ³ãƒ•ã‚£ã‚°ã‚’ tftpd server ã«ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã—ã¾ã™ã€‚
```
[tftpd server] .1 === (10.2.0.0/24) === .254 f0/0[r1]
```

## tftpd ã‚µãƒ¼ãƒã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«

tftpd ã‚µãƒ¼ãƒã¨ã—ã¦ã€tftpd-hpa ã‚’åˆ©ç”¨ã—ã¾ã™ã€‚
å˜ä½“è©¦é¨“ã®ãŸã‚ tftpd-hpa ã‚‚ã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«ã—ã¾ã™ã€‚
```
sudo apt install -y tftpd-hpa tftp-hpa
```

:::message
tftpd ã¯è»¢é€ã§ãã‚‹ãƒ•ã‚¡ã‚¤ãƒ«ã®æœ€å¤§ã‚µã‚¤ã‚ºãŒ 16MB ã¨ãªã£ã¦ã„ã‚‹ã‚‚ã®ãŒã‚ã‚‹ã‚ˆã†ã§ã™ã€‚
16MBä»¥ä¸Šã®ãƒ•ã‚¡ã‚¤ãƒ«ã‚’è»¢é€ã™ã‚‹ã«ã¯ã€ãã‚Œã«å¯¾å¿œã—ãŸ tftpd ã‚½ãƒ•ãƒˆã‚’åˆ©ç”¨ã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚
(ios ã‚¤ãƒ¡ãƒ¼ã‚¸ã®ã‚³ãƒ”ãƒ¼ã‚’ã™ã‚‹å ´åˆã¯è¦æ³¨æ„ã§ã™)
:::

https://www.cisco.com/c/ja_jp/support/docs/routers/10000-series-routers/48700-tftp-server.html

## å‹•ä½œç¢ºèª

é–¢é€£ãƒ‘ãƒƒã‚±ãƒ¼ã‚¸ã‚’ã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«ã—ãŸã‚‰ /srv/tftp é…ä¸‹ã«ãƒ†ã‚¹ãƒˆç”¨ãƒ•ã‚¡ã‚¤ãƒ« helloworld ã‚’é…ç½®ã—ã¦ tftp ã§ get ã—ã¦ã¿ã¾ã™ã€‚

```
$ echo helloworld | sudo tee -a /srv/tftp/helloworld
helloworld
$ tftp 10.2.0.1 -c get helloworld

$ ls helloworld
helloworld
```

æ¬¡ã«ã€tftp ã§ãƒ•ã‚¡ã‚¤ãƒ« helloworld.1 ã‚’ put ã—ã¦ã¿ã¾ã™ã€‚
æœ€åˆã« /srv/tftp é…ä¸‹ã«ç©ºã®ãƒ•ã‚¡ã‚¤ãƒ«ã‚’ä½œæˆã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚

```
$ sudo touch /srv/tftp/helloworld.1
$ sudo chmod 766 /srv/tftp/helloworld.1
$ mv helloworld helloworld.1
$ cat << END | tftp 10.2.0.1
> put helloworld.1
> END

$ cat /srv/tftp/helloworld.1
helloworld
```

# ã‚³ãƒ³ãƒ•ã‚£ã‚°ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—

ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã‚’å®Ÿè¡Œã™ã‚‹å‰ã« /srv/tftp é…ä¸‹ã«ç©ºã®ãƒ•ã‚¡ã‚¤ãƒ«ã‚’ä½œæˆã—ã¾ã™ã€‚

```
$ sudo touch /srv/tftp/r1-config
$ sudo chmod 766 /srv/tftp/r1-config
```

ç©ºãƒ•ã‚¡ã‚¤ãƒ«ã‚’ä½œæˆã—ãŸã‚‰ã€ã‚³ãƒ³ãƒ•ã‚£ã‚°ã‚’ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã—ã¾ã™ã€‚

```
r1#ping 10.2.0.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.0.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 4/6/8 ms

r1#copy start tftp://10.2.0.1/r1-config
Address or name of remote host [10.2.0.1]?
Destination filename [r1-config]?
!!
776 bytes copied in 0.044 secs (17636 bytes/sec)
```

ãƒ•ã‚¡ã‚¤ãƒ«ãŒæ›´æ–°ã•ã‚ŒãŸã“ã¨ã‚’ç¢ºèªã—ã¾ã™ã€‚
ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã—ãŸãƒ•ã‚¡ã‚¤ãƒ«ãŒä¸Šæ›¸ãã•ã‚Œãªã„ã‚ˆã†ã«ã€ã‚³ãƒ”ãƒ¼ã‚’ä½œæˆã—ã¦ãŠãã¾ã™ã€‚

```
$ ls -l /srv/tftp/r1-config{,.000}
$ sudo cp -pi /srv/tftp/r1-config{,.000}
$ ls -l /srv/tftp/r1-config{,.000}
```

# ã‚³ãƒ³ãƒ•ã‚£ã‚°æˆ»ã—ã®æ¤œè¨¼

å¤‰æ›´å‰ã®è¨­å®šã‚’ä¿å­˜ã—ã¦ãŠãã¾ã™ã€‚
```
r1#terminal length 0
r1#show run | redirect flash:config-before

r1#show flash:
-#- --length-- -----date/time------ path
1          837 Mar 01 2002 00:17:06 config-before

61440 bytes available (2048 bytes used)
```

## å‹•ä½œã®ç¢ºèªã®ãŸã‚è¨­å®šã‚’å¤‰æ›´

1. å¿…è¦ãªæƒ…å ±ã‚’å‰Šé™¤ã—ã¾ã™ã€‚
```
r1(config)#router ospf 1
r1(config-router)#no network 10.2.1.0 0.0.0.255 area 0
```

2. èª¤ã£ãŸè¨­å®šã‚’å…¥ã‚Œã¾ã™ã€‚
```
r1(config)#int fa0/1
r1(config-if)#shut
```

3. ä¸è¦ãªæƒ…å ±ã‚’è¿½åŠ ã—ã¾ã™ã€‚
```
r1(config)#enable password cisco
```

ç¢ºèªã®ãŸã‚å¤‰æ›´å¾Œã®è¨­å®šã‚’ä¿å­˜ã—ã¦ãŠãã¾ã™ã€‚
```
r1#show run | redirect flash:config-edit

r1#show flash:
-#- --length-- -----date/time------ path
1          837 Mar 01 2002 00:17:06 config-before
2          834 Mar 01 2002 00:21:40 config-edit

59392 bytes available (4096 bytes used)
```

å·®åˆ†ã‚’ç¢ºèªã™ã‚‹ã¨ä»¥ä¸‹ã®ã‚ˆã†ã«ãªã‚Šã¾ã™ã€‚
```
r1#show archive config differences flash:config-before flash:config-edit
Contextual Config Diffs:
+Current configuration : 773 bytes
+enable password cisco
interface FastEthernet0/1
 +shutdown
-Current configuration : 776 bytes
router ospf 1
 -network 10.2.1.0 0.0.0.255 area 0
```

- enable password ã®è¡ŒãŒè¿½åŠ ã•ã‚Œã¦ã„ã‚‹
- shutdown ã®è¡ŒãŒè¿½åŠ ã•ã‚Œã¦ã„ã‚‹
- network ã®è¡ŒãŒå‰Šé™¤ã•ã‚Œã¦ã„ã‚‹

## ã‚³ãƒ³ãƒ•ã‚£ã‚°ã®æˆ»ã—ã‚’å®Ÿè¡Œ

ã“ã“ã§ã€å‰é …ã§ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã—ãŸã‚³ãƒ³ãƒ•ã‚£ã‚°ã‚’æˆ»ã—ã¦ã¿ã¾ã™ã€‚

```
r1#copy tftp://10.2.0.1/r1-config run
Destination filename [running-config]?
Accessing tftp://10.2.0.1/r1-config...
Loading r1-config from 10.2.0.1 (via FastEthernet0/0): !
[OK - 776 bytes]

776 bytes copied in 9.284 secs (84 bytes/sec)

*Mar  1 00:23:38.923: %SYS-5-CONFIG_I: Configured from tftp://10.2.0.1/r1-config by console
```

ç¢ºèªã®ãŸã‚ã‚³ãƒ³ãƒ•ã‚£ã‚°æˆ»ã—ã‚’å®Ÿè¡Œã—ãŸæ™‚ç‚¹ã®è¨­å®šã‚’ä¿å­˜ã—ã¦ãŠãã¾ã™ã€‚
```
r1#show run | redirect flash:config-after

r1#
r1#show flash:
-#- --length-- -----date/time------ path
1          837 Mar 01 2002 00:17:06 config-before
2          834 Mar 01 2002 00:21:40 config-edit
3          869 Mar 01 2002 00:24:16 config-after

57344 bytes available (6144 bytes used)
```

## çµæœã‚’ç¢ºèª

å¤‰æ›´ã‚’è¡Œã†å‰ã®ã‚³ãƒ³ãƒ•ã‚£ã‚°ã¨æ¯”è¼ƒã™ã‚‹ã¨ã€åŒã˜å†…å®¹ã«æˆ»ã£ã¦ã„ã¾ã›ã‚“ã€‚
```
r1#show archive config differences flash:config-before flash:config-after
Contextual Config Diffs:
+Current configuration : 808 bytes
+enable password cisco
interface FastEthernet0/1
 +shutdown
-Current configuration : 776 bytes
```

- enable password ã®è¡ŒãŒè¿½åŠ ã•ã‚Œã¦ã„ã‚‹
- shutdown ã®è¡ŒãŒè¿½åŠ ã•ã‚Œã¦ã„ã‚‹

running-config ã«å¯¾ã™ã‚‹ã‚³ãƒ”ãƒ¼ã¯ã€ãƒãƒ¼ã‚¸ã®å½¢ã«ãªã‚Šã¾ã™ã€‚
å•†ç”¨ã®è¤‡é›‘ãªè¨­å®šãŒå…¥ã£ã¦ã„ã‚‹æ©Ÿå™¨ã®å ´åˆã¯ã€éå¸¸ã«é¢å€’ãªã‚‚ã®ã¨ãªã‚Šã¾ã™ã€‚
ä¸‹è¨˜ã«ã‚ˆã‚‹ã¨ `ãƒˆãƒ©ãƒ–ãƒ«ã®å…ƒ` `å®Ÿç’°å¢ƒã«ãŠã„ã¦ã¯ä½¿ç”¨ã—ãªã„` ã¨ã®ã“ã¨ã§ã™ã€‚

https://www.infraexpert.com/study/ciscoios9.html

## å¾Œç‰‡ä»˜ã‘

ç¢ºèªãŒçµ‚ã‚ã£ãŸã‚‰ä¸è¦ãªãƒ•ã‚¡ã‚¤ãƒ«ã‚’å‰Šé™¤ã—ã¾ã™ã€‚
```
r1#delete flash:config-before
Delete filename [config-before]?
Delete flash:config-before? [confirm]

r1#delete flash:config-edit
Delete filename [config-edit]?
Delete flash:config-edit? [confirm]

r1#delete flash:config-after
Delete filename [config-after]?
Delete flash:config-after? [confirm]

r1#show flash
No files on device

63488 bytes available (0 bytes used)
```

# (ç•ªå¤–ç·¨) Cisco ãƒ‡ãƒã‚¤ã‚¹ã‚’ tftp ã‚µãƒ¼ãƒã¨ã—ã¦åˆ©ç”¨ã™ã‚‹

https://community.cisco.com/t5/networking-knowledge-base/how-to-configure-a-cisco-router-as-tftp-server/ta-p/3125212

tftp ã‚¯ãƒ©ã‚¤ã‚¢ãƒ³ãƒˆã«å¯¾ã—ã¦ç‰¹å®šã®ãƒ•ã‚¡ã‚¤ãƒ«ã ã‘ get ã•ã›ã‚‹ã‚ˆã†ãªå½¢ã®tftp ã‚µãƒ¼ãƒã¨ã—ã¦æ©Ÿèƒ½ã•ã›ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```
r1#conf t
r1(config)#tftp-server flash:config-after
```

tftp ã‚¯ãƒ©ã‚¤ã‚¢ãƒ³ãƒˆã§ get ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```
$ tftp 10.2.0.254 -c get config-after
$ ls config-after
config-after
```

# ã¾ã¨ã‚

è¨­å®šã‚’æˆ»ã™æ™‚ã¯ `copy tftp: run` ã‚’ä½¿ã†ã¨ã€è¨­å®šãŒãƒãƒ¼ã‚¸ã•ã‚Œã¦è¤‡é›‘ã«ãªã‚‹ãŸã‚ã€
ã‚¿ãƒ¼ãƒŸãƒŠãƒ«ç”»é¢ã«ã‚³ãƒ³ãƒ•ã‚£ã‚°ã‚’è²¼ã‚Šä»˜ã‘ã¦å…¥åŠ›ã™ã‚‹ã“ã¨ã§æˆ»ã™ã®ãŒã‚ˆã•ãã†ã§ã™ã€‚

