---
title: "ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã®ç·´ç¿’"
emoji: "ğŸ—ï¸"
type: "tech" # tech: æŠ€è¡“è¨˜äº‹ / idea: ã‚¢ã‚¤ãƒ‡ã‚¢
topics: ["cisco", "ccna", "dynamips", "dynagen"]
published: true
---

# æœ¬ã‚¨ãƒ³ãƒˆãƒªã«ã¤ã„ã¦

Dynagenã€Dynamips ã‚’ä½¿ã£ã¦ã€vty ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã€ã‚³ãƒ³ã‚½ãƒ¼ãƒ«ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã®è¨­å®šã‚’ç·´ç¿’ã—ã¾ã™ã€‚
Dynagenã€Dynamips ã®åˆ©ç”¨ç’°å¢ƒã¯ã™ã§ã«æ•´ã£ã¦ã„ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

## å‚è€ƒ
https://www.infraexpert.com/study/ciscorouter6.html

# ç’°å¢ƒã«ã¤ã„ã¦

```mermaid
architecture-beta
    group pc0(cloud)[pc0]
    service br1(internet)[br1] in pc0
    service tap0(internet)[tap0] in pc0
    service r1(internet)[r1]
    service r2(internet)[r2]

    br1:R -- L:tap0
    tap0:R -- L:r1
    r1:R -- L:r2
```

| device | interface | ip address | network address | comment |
| --- | ----  | ---           | --- | --- |
| pc0 | br1   | 10.2.0.1/24 | 10.2.0.0 | å®Ÿæ©ŸLinuxã«è¨­å®šã—ãŸä»®æƒ³ãƒ–ãƒªãƒƒã‚¸ |
| r1  | fe0/0 | 10.2.0.254/24 |^ |  | 
|^    | fe0/1 | 10.2.1.253/24 | 10.2.1.0 |  | 
| r2  | fe0/0 | 10.2.1.254/24 |^  |  |
|^    | fe0/1 | 10.2.2.253/24 | 10.2.2.0 |  |


```:Dynagen è¨­å®šãƒ•ã‚¡ã‚¤ãƒ«æŠœç²‹
    [[ROUTER r1]]
        model = 3725
        console = 2001
        f0/0 = nio_tap:tap0
        #f0/0 = NIO_linux_eth:ens5
        f0/1 = r2 f0/0
    
    [[ROUTER r2]]
        model = 3725
        console = 2002
```

ä¸Šè¨˜ã®ã‚ˆã†ã« **nio_tap:tap0** ã‚’è¨˜è¼‰ã—ã¦ dynagen ã‚’å®Ÿè¡Œã™ã‚‹ã¨ã€tap0 ãƒ‡ãƒã‚¤ã‚¹ãŒä½œæˆã•ã‚Œã¾ã™ã€‚
ã“ã‚Œã‚’ä»®æƒ³ãƒ–ãƒªãƒƒã‚¸ã«æ¥ç¶šã—ã¦ã€å®Ÿæ©Ÿã¨é€šä¿¡ã—ã¾ã™ã€‚

(**NIO_linux_eth:ens5** ã®ã‚ˆã†ã«è¨˜è¼‰ã™ã‚‹ã¨ã€ãƒªã‚¢ãƒ«NICã¨æ¥ç¶šã§ãã¾ã™)

## ä»®æƒ³ãƒ–ãƒªãƒƒã‚¸ã®ä½œæˆ

ä¸‹è¨˜ã§ã€å®Ÿæ©ŸLinuxã«ä»®æƒ³ãƒ–ãƒªãƒƒã‚¸ã‚’è¨­å®šã—ã¾ã™
```
$ sudo brctl addbr br1
$ sudo brctl show
bridge name     bridge id               STP enabled     interfaces
br1             8000.000000000000       no

$ sudo ip addr add 10.2.0.1/24 dev br1
$ ip a show br1
3: br1: <BROADCAST,MULTICAST> mtu 1500 qdisc noop state DOWN group default qlen 1000
    link/ether e2:1b:3c:00:1b:87 brd ff:ff:ff:ff:ff:ff
    inet 10.2.0.1/24 scope global br1
       valid_lft forever preferred_lft forever
```

## tap ãƒ‡ãƒã‚¤ã‚¹ã®æ¥ç¶š

dynagen ã‚’å®Ÿè¡Œã™ã‚‹ã¨ã€tap0 ãŒä½œæˆã•ã‚Œã‚‹ã®ã§ã€ã“ã‚Œã‚’ br1 ã«æ¥ç¶šã—ã¾ã™ã€‚
```
$ sudo brctl addif br1 tap0
$ sudo brctl show
bridge name     bridge id               STP enabled     interfaces
br1             8000.9a22a8b110bb       no              tap0
```

ã‚¤ãƒ³ã‚¿ãƒ•ã‚§ãƒ¼ã‚¹ã‚’ up ã—ã¾ã™
```
$ sudo ip link set br1 up
$ sudo ip link set tap0 up
```

## r1 åŸºæœ¬è¨­å®š

```
conf t
hostname r1
int fa0/0
ip address 10.2.0.254 255.255.255.0
no shut
int fa0/1
ip address 10.2.1.253 255.255.255.0
no shut
```

## r2 åŸºæœ¬è¨­å®š

```
conf t
hostname r2
int fa0/0
ip address 10.2.1.254 255.255.255.0
no shut
int fa0/1
ip address 10.2.2.253 255.255.255.0
no shut
```

# vty ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã®è¨­å®š

ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¨­å®šã—ã¦ã„ãªã„çŠ¶æ…‹ã§ã™ã€‚

```
r1#show ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.2.0.254      YES NVRAM  up                    up
FastEthernet0/1            10.2.1.253      YES NVRAM  up                    up

# show run | section vty
line vty 0 4
 login
r1#
```

ã“ã®ã¨ãã€telnet æ¥ç¶šå¾Œã«ã™ãã«åˆ‡æ–­ã•ã‚Œã¾ã™ã€‚
ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ãŒè¨­å®šã•ã‚Œã¦ã„ãªã„ãŸã‚æ‹’å¦ã•ã‚Œã¾ã™ã€‚

```
$ telnet 10.2.0.254
Trying 10.2.0.254...
Connected to 10.2.0.254.
Escape character is '^]'.


Password required, but none set
Connection closed by foreign host.
```

ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¨­å®šã—ã¾ã™ã€‚

```
(config)# line vty 0 4
(config-line)# password cisco

# show run | section vty
line vty 0 4
 password cisco
 login
```

telnet æ¥ç¶šã§ãã‚‹ã‚ˆã†ã«ãªã‚Šã¾ã—ãŸã€‚
ã“ã“ã§ enable ã—ã‚ˆã†ã¨ã™ã‚‹ã¨ã€ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ãŒè¨­å®šã•ã‚Œã¦ã„ãªã„ãŸã‚æ‹’å¦ã•ã‚Œã¾ã™ã€‚

```
$ telnet 10.2.0.254
Trying 10.2.0.254...
Connected to 10.2.0.254.
Escape character is '^]'.


User Access Verification

Password:
r1>
r1>en
% No password set
r1>
```

enable ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¨­å®šã—ã¾ã™ã€‚

```
(config)# enable secret cisco

# show run | section vty
line vty 0 4
 password cisco
 login

# show run | section enable
enable secret 5 $1$EKLJ$lQ7079xXjUmKrj2TCf6Mx1

```

telnet å¾Œã€enable ã§ãã‚‹ã‚ˆã†ã«ãªã‚Šã¾ã—ãŸã€‚

```
$ telnet 10.2.0.254
Trying 10.2.0.254...
Connected to 10.2.0.254.
Escape character is '^]'.


User Access Verification

Password:
r1>
r1>en
Password:
r1#
```

# ã‚³ãƒ³ã‚½ãƒ¼ãƒ«ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰

ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¨­å®šã—ã¾ã™ã€‚

```
#show run | section line con
line con 0

r1#conf t
r1(config)#line con 0
r1(config-line)#password cisco

r1#show run | section line con
line con 0
 password cisco
```

ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ãŒè¦æ±‚ã•ã‚Œã¾ã›ã‚“ã€‚

```
Press RETURN to get started.



r1>
```

`login` ã‚’è¿½åŠ ã—ã¾ã™ã€‚

```
r1(config)#line con 0
r1(config-line)#login

r1#show run | section line con
line con 0
 password cisco
 login
r1#
```

ç„¡äº‹ã€ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ãŒè¦æ±‚ã•ã‚Œã‚‹ã‚ˆã†ã«ãªã‚Šã¾ã—ãŸã€‚

```
Press RETURN to get started.




User Access Verification

Password:
r1>
```

# ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰æš—å·åŒ–

`service password-encryption` ã«ã‚ˆã£ã¦ã€å¹³æ–‡ã§è¨­å®šã—ãŸãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ãŒæš—å·åŒ–ã•ã‚Œã¾ã™ã€‚

```
r1(config)#service password-encryption

r1#show run | section line
line con 0
 password 7 14141B180F0B
 login
line aux 0
line vty 0 4
 password 7 121A0C041104
 login
```

ä»Šå¾Œå…¥åŠ›ã™ã‚‹ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚‚æš—å·åŒ–ã—ã¦ä¿å­˜ã•ã‚Œã¾ã™ã€‚

```
r1(config)#line vty 0 4
r1(config-line)#password ccnp

r1#show run | section line vty
line vty 0 4
 password 7 1306141C1B
 login
```

`no service password-encryption` ã«ã‚ˆã£ã¦ã€ä»¥å¾Œã®ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã®æš—å·åŒ–ã¯ã•ã‚Œãªããªã‚Šã¾ã™ã€‚
ä¸€åº¦æš—å·åŒ–ã—ãŸãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’å¹³æ–‡ã«æˆ»ã™ã“ã¨ã¯ã§ãã¾ã›ã‚“ã€‚

```
r1(config)#no service password-encryption
r1(config)#line vty 0 4
r1(config-line)#password ccnp

r1#show run | section line
line con 0
 password 7 14141B180F0B
 login
line aux 0
line vty 0 4
 password ccnp
 login
```

# æš—å·åŒ–ã‚¿ã‚¤ãƒ—ã«ã¤ã„ã¦

ã‚³ãƒ³ãƒ•ã‚£ã‚°ã®æš—å·åŒ–ã•ã‚ŒãŸãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã®å‰ã«è¡¨ç¤ºã•ã‚Œã‚‹æ•°å­—ãŒã€æš—å·åŒ–ã‚¿ã‚¤ãƒ—ã‚’ç¤ºã—ã¦ã„ã¾ã™ã€‚

ä¸‹è¨˜ã® `5` ã®å ´åˆã€md5 ã§æš—å·åŒ–(ãƒãƒƒã‚·ãƒ¥åŒ–)ã•ã‚Œã¦ã„ã‚‹ã“ã¨ã‚’ç¤ºã—ã¦ã„ã¾ã™ã€‚

```
enable secret 5 $1$EKLJ$lQ7079xXjUmKrj2TCf6Mx1
```

ä¸‹è¨˜ã® `7` ã®å ´åˆã¯ã€è¤‡åˆå¯èƒ½ãªæš—å·åŒ–ã§ã™ã€‚

```
password 7 14141B180F0B
```

é€šå¸¸ã ã¨ã€ã‚³ãƒãƒ³ãƒ‰ã§ã¯å¹³æ–‡ã®ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’å…¥åŠ›ã—ã¾ã™ãŒã€æš—å·åŒ–ã‚¿ã‚¤ãƒ—ã€æš—å·åŒ–æ¸ˆã¿æ–‡å­—åˆ—ã‚’æŒ‡å®šã—ã¦å…¥åŠ›ã™ã‚‹ã“ã¨ã‚‚ã§ãã¾ã™ã€‚

ãƒ©ã‚¤ãƒ³ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã®ä¾‹ã§ã™ã€‚
```
r1(config)#line vty 0 4
r1(config-line)#password ?
  0     Specifies an UNENCRYPTED password will follow
  7     Specifies a HIDDEN password will follow
  LINE  The UNENCRYPTED (cleartext) line password

r1(config-line)#password 7 14141B180F0B

r1#show run | section line vty
line vty 0 4
 password 7 14141B180F0B
 login
```

enable secret ã®ä¾‹ã§ã™ã€‚
```
r1(config)#enable secret ?
  0      Specifies an UNENCRYPTED password will follow
  5      Specifies an ENCRYPTED secret will follow
  LINE   The UNENCRYPTED (cleartext) 'enable' secret
  level  Set exec level password

r1(config)#enable secret 5 $1$EKLJ$lQ7079xXjUmKrj2TCf6Mx1

r1#show run | section enable
enable secret 5 $1$EKLJ$lQ7079xXjUmKrj2TCf6Mx1
```

# access-class

`access-class` ã‚’åˆ©ç”¨ã—ã¦ã€ã‚¢ã‚¯ã‚»ã‚¹ã‚’åˆ¶é™ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

## ã‚¢ã‚¯ã‚»ã‚¹å…ƒã®åˆ¶é™

10.2.1.254 ã®ã¿ã‚’è¨±å¯ã™ã‚‹ACLã‚’ä½œæˆã—ã¾ã™ã€‚
```
r1(config)#access-list 1 permit 10.2.1.254 0.0.0.0

r1#show ip access-lists 1
Standard IP access list 1
    10 permit 10.2.1.254 (2 matches)
```

ä½œæˆã—ãŸACLã‚’é©ç”¨ã—ã¾ã™
```
r1(config)#line vty 0 4
r1(config-line)#access-class 1 in

r1#show run | section line vty
line vty 0 4
 access-class 1 in
 password cisco
 login
```

è¨±å¯ã•ã‚Œã¦ã„ãªã„ã‚¢ãƒ‰ãƒ¬ã‚¹ã‹ã‚‰ã®ã‚¢ã‚¯ã‚»ã‚¹ã¯æ‹’å¦ã•ã‚Œã¾ã™ã€‚

```
admin@ip-10-0-0-73:~$ telnet 10.2.0.254
Trying 10.2.0.254...
telnet: Unable to connect to remote host: Connection refused
```

r2 ã‹ã‚‰ã®ã‚¢ã‚¯ã‚»ã‚¹ã¯æ‹’å¦ã•ã‚Œã¦ã„ã¾ã›ã‚“ã€‚
```
r2#telnet 10.2.1.253
Trying 10.2.1.253 ... Open


User Access Verification

Password: 
r1>
```

## ã‚¢ã‚¯ã‚»ã‚¹å…ˆã®åˆ¶é™

å…ˆç¨‹ä½œæˆã—ãŸACLã‚’åˆ©ç”¨ã—ã¾ã™
```
r1#show access-lists 1
Standard IP access list 1
    10 permit 10.2.1.254 (3 matches)
```

ã“ã¡ã‚‰ã®ã‚ˆã†ã«ã™ã‚‹ã¨ã€ä»®æƒ³ç«¯æœ«ã‹ã‚‰æ¥ç¶šã§ãã‚‹å…ˆã‚’åˆ¶é™ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚
```
r1(config)#line vty 0 4
r1(config-line)#access-class 1 out

r1#show run | section line vty
line vty 0 4
 access-class 1 out
 password cisco
 login
```

ä»®æƒ³ç«¯æœ«ã«æ¥ç¶šã—ãŸå¾Œã€è¨±å¯ã•ã‚Œã¦ã„ãªã„ã‚¢ãƒ‰ãƒ¬ã‚¹ã¸ã®ã‚¢ã‚¯ã‚»ã‚¹ã¯æ‹’å¦ã•ã‚Œã¾ã™ã€‚

```
$ telnet 10.2.0.254
Trying 10.2.0.254...
Connected to 10.2.0.254.
Escape character is '^]'.


User Access Verification

Password:
r1>
r1>telnet 10.2.1.253
Trying 10.2.1.253 ...
% Connections to that host not permitted from this terminal
```

#  ã¾ã¨ã‚

- vty æ¥ç¶šã¯ `line` ãŒè¨­å®šæ¸ˆã¿ãªã®ã§ã€`password` ã‚’è¿½åŠ ã™ã‚‹ã ã‘ã€‚
- vty æ¥ç¶šã§ã¯ã€enable ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ãŒç„¡ã„ã¨ã€enable ã§ããªã„ã€‚
- ã‚³ãƒ³ã‚½ãƒ¼ãƒ«æ¥ç¶šã§ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã‚’è¦æ±‚ã™ã‚‹ã«ã¯ `password` ã¨ `line` ã®è¨­å®šãŒå¿…è¦ã€‚
- `access-class` ã§æ¥ç¶šã‚’åˆ¶é™

ã“ã“ã§ã¯ã‚³ãƒ³ãƒ•ã‚£ã‚°ã®ãƒ‘ã‚¹ãƒ¯ãƒ¼ãƒ‰ã«ã¤ã„ã¦ã®ç®‡æ‰€ã‚’è¨˜è¼‰ã—ã¦ã¾ã™ãŒã€æ™®é€šã§ã™ã¨å…¬ã«ã—ã¦ã¯ã„ã‘ãªã„æƒ…å ±ã§ã™ã€‚
